Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/api/enums/chat_action.po
Languages: uk_ua

source: This object represents bot actions.
uk_ua: Цей об’єкт представляє дії бота.

source: Choose one, depending on what the user is about to receive:
uk_ua: Виберіть один залежно від того, що користувач збирається отримати:

source: typing for text messages,
uk_ua: typing для текстових повідомлень,

source: upload_photo for photos,
uk_ua: upload_photo для фотографій,

source: record_video or upload_video for videos,
uk_ua: record_video або upload_video для відео,

source: record_voice or upload_voice for voice notes,
uk_ua: record_voice або upload_voice для голосових повідомлень,

source: upload_document for general files,
uk_ua: upload_document для загальних файлів,

source: choose_sticker for stickers,
uk_ua: choose_sticker для наклейок,

source: find_location for location data,
uk_ua: find_location для данних про місце знаходження,

source: record_video_note or upload_video_note for video notes.
uk_ua: record_video_note або upload_video_note для відео кружків.

source: Source: https://core.telegram.org/bots/api#sendchataction
uk_ua: Джерело: https://core.telegram.org/bots/api#sendchataction
