Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/filters/callback_data.po
Languages: uk_ua

source: Callback Data Factory & Filter
uk_ua: Фабрика міток зворотнього виклику та фільтрування

source: Base class for callback data wrapper
uk_ua: Базовий клас для обгортки мітки зворотного виклику

source: This class should be used as super-class of user-defined callbacks.
uk_ua: Цей клас слід використовувати як супер-клас зворотних викликів, визначених користувачем.

source: The class-keyword :code:`prefix` is required to define prefix and also the argument :code:`sep` can be passed to define separator (default is :code:`:`).
uk_ua: Ключове слово класу :code:`prefix` потрібне для визначення префікса, а також аргумент :code:`sep` можна передати для визначення роздільника (за замовчуванням це :code:`:`).

source: Generate callback data string
uk_ua: Генерування рядок мітки зворотного виклику

source: Returns
uk_ua: Повертає

source: valid callback data for Telegram Bot API
uk_ua: дійсна мітка зворотного виклику для Telegram Bot API

source: Parse callback data string
uk_ua: Аналіз рядка мітки зворотного виклику

source: Parameters
uk_ua: Параметри

source: value from Telegram
uk_ua: значення з Telegram

source: instance of CallbackData
uk_ua: екземпляр мітки зворотного виклику

source: Generates a filter for callback query with rule
uk_ua: Створює фільтр для запиту зворотного виклику з правилом

source: magic rule
uk_ua: магічне правило

source: instance of filter
uk_ua: екземпляр фільтру

source: Usage
uk_ua: Використання

source: Create subclass of :code:`CallbackData`:
uk_ua: Створення підкласу :code:`CallbackData`:

source: After that you can generate any callback based on this class, for example:
uk_ua: Після цього ви можете створити будь-який зворотній виклик на основі цього класу, наприклад:

source: So... Now you can use this class to generate any callbacks with defined structure
uk_ua: Отже... Тепер ви можете використовувати цей клас для створення будь-яких зворотних викликів із визначеною структурою

source: ... and handle by specific rules
uk_ua: ... і обробляти за певними правилами

source: You can accept :code:`callback_data` as another argument to the handler, and it will be unpacked to instance of :code:`MyCallback` class. **The unpacking is performed only if the handler is decorated with** :code:`MyCallback.filter(...)`.
uk_ua: Ви можете приймати :code:`callback_data` як додатковий аргумент до обробника, і він буде розпакований до екземпляру класу :code:`MyCallback`. **Розпакування виконується тільки якщо обробник декорований** :code:`MyCallback.filter(...)`.

source: Also can be used in :doc:`Keyboard builder </utils/keyboard>`:
uk_ua: Також може бути використаний в :doc:`Конструкторі клавіатури </utils/keyboard>`:

source: Another abstract example:
uk_ua: Ще один абстрактний приклад:

source: Known limitations
uk_ua: Відомі обмеження

source: Allowed types and their subclasses:
uk_ua: Дозволені типи та їх підкласи:

source: :code:`Enum` (:code:`from enum import Enum`, only for string enums)
uk_ua: :code:`Enum` (:code:`from enum import Enum`, лише для переліків рядків)

source: :code:`IntEnum` (:code:`from enum import IntEnum`, only for int enums)
uk_ua: :code:`IntEnum` (:code:`from enum import IntEnum`, тільки для переліків int)

source: Note that the integer Enum's should be always is subclasses of :code:`IntEnum` in due to parsing issues.
uk_ua: Зауважте, що ціле число Enum завжди має бути підкласом :code:`IntEnum` через проблеми з синтаксичним аналізом.
