Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/filters/chat_member_updated.po
Languages: uk_ua

source: ChatMemberUpdated
uk_ua: Зміна статусу користувача в чаті

source: Usage
uk_ua: Використання

source: Handle user leave or join events
uk_ua: Керуйте подіями, які залишають користувачів або приєднуються

source: Or construct your own terms via using pre-defined set of statuses and transitions.
uk_ua: Або створіть власні умови, використовуючи попередньо визначений набір статусів і переходів.

source: You can import from :code:`aiogram.filters` all available variants of `statuses`_, `status groups`_ or `transitions`_:
uk_ua: Ви можете імпортувати з :code:`aiogram.filters` усі доступні варіанти `statuses`_, `status group`_ або `transitions`_:

source: Statuses
uk_ua: Статуси

source: name
uk_ua: ім'я

source: Description
uk_ua: Опис

source: Chat owner
uk_ua: Власник чату

source: Chat administrator
uk_ua: Адміністратор чату

source: Member of the chat
uk_ua: Учасник чату

source: Restricted user (can be not member)
uk_ua: Обмежений користувач (може бути не учасником)

source: Isn't member of the chat
uk_ua: Не є учасником чату

source: Kicked member by administrators
uk_ua: Вигнанийадміністраторами учасник

source: Statuses can be extended with `is_member` flag by prefixing with :code:`+` (for :code:`is_member == True)` or :code:`-` (for :code:`is_member == False`) symbol, like :code:`+RESTRICTED` or :code:`-RESTRICTED`
uk_ua: Статуси можна розширити маркером `is_member`, додавши префікс :code:`+` (для :code:`is_member == True)` або :code:`-` (для :code:`is_member == False`) , наприклад :code:`+RESTRICTED` або :code:`-RESTRICTED`

source: Status groups
uk_ua: Групи статусів

source: The particular statuses can be combined via bitwise :code:`or` operator, like :code:`CREATOR | ADMINISTRATOR`
uk_ua: Окремі статуси можна комбінувати за допомогою побітового оператора :code:`or`, наприклад :code:`CREATOR | ADMINISTRATOR`

source: Combination of :code:`(CREATOR | ADMINISTRATOR | MEMBER | +RESTRICTED)` statuses.
uk_ua: Комбінація статусів :code:`(CREATOR | ADMINISTRATOR | MEMBER | +RESTRICTED)`.

source: Combination of :code:`(CREATOR | ADMINISTRATOR)` statuses.
uk_ua: Комбінація статусів :code:`(CREATOR | ADMINISTRATOR)`.

source: Combination of :code:`(LEFT | KICKED | -RESTRICTED)` statuses.
uk_ua: Комбінація статусів :code:`(LEFT | KICKED | -RESTRICTED)` .

source: Transitions
uk_ua: Переходи

source: Transitions can be defined via bitwise shift operators :code:`>>` and :code:`<<`. Old chat member status should be defined in the left side for :code:`>>` operator (right side for :code:`<<`) and new status should be specified on the right side for :code:`>>` operator (left side for :code:`<<`)
uk_ua: Переходи можна визначити за допомогою операторів порозрядного зсуву :code:`>>` і :code:`<<`. Старий статус учасника чату має бути визначений ліворуч для оператора :code:`>>` (праворуч для :code:`<<`), а новий статус має бути вказаний праворуч для :code:`>>` оператор (ліворуч для :code:`<<`)

source: The direction of transition can be changed via bitwise inversion operator: :code:`~JOIN_TRANSITION` will produce swap of old and new statuses.
uk_ua: Напрямок переходу можна змінити за допомогою оператора побітової інверсії: :code:`~JOIN_TRANSITION` призведе до обміну старих і нових статусів.

source: Means status changed from :code:`IS_NOT_MEMBER` to :code:`IS_MEMBER` (:code:`IS_NOT_MEMBER >> IS_MEMBER`)
uk_ua: Означає, що статус змінено з :code:`IS_NOT_MEMBER` на :code:`IS_MEMBER` (:code:`IS_NOT_MEMBER >> IS_MEMBER`)

source: Means status changed from :code:`IS_MEMBER` to :code:`IS_NOT_MEMBER` (:code:`~JOIN_TRANSITION`)
uk_ua: Означає, що статус змінено з :code:`IS_MEMBER` на :code:`IS_NOT_MEMBER` (:code:`~JOIN_TRANSITION`)

source: Means status changed from :code:`(MEMBER | RESTRICTED | LEFT | KICKED) >> ADMINISTRATOR` (:code:`(MEMBER | RESTRICTED | LEFT | KICKED) >> ADMINISTRATOR`)
uk_ua: Означає, що статус змінено з :code:`(MEMBER | RESTRICTED | LEFT | KICKED) >> ADMINISTRATOR` (:code:`(MEMBER | RESTRICTED | LEFT | KICKED) >> ADMINISTRATOR`)

source: Note that if you define the status unions (via :code:`|`) you will need to add brackets for the statement before use shift operator in due to operator priorities.
uk_ua: Зауважте, що якщо ви визначаєте об’єднання статусів (через :code:`|`), вам потрібно буде додати дужки для оператора перед використанням оператора зсуву через пріоритети оператора.

source: Allowed handlers
uk_ua: Дозволені обробники

source: Allowed update types for this filter:
uk_ua: Дозволені типи оновлень для цього фільтра:
