Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/filters/index.po
Languages: uk_ua

source: Filtering events
uk_ua: Фільтрування подій

source: Builtin filters
uk_ua: Вбудовані фільтри

source: Here is list of builtin filters:
uk_ua: Ось список вбудованих фільтрів:

source: Writing own filters
uk_ua: Написання власних фільтрів

source: Filters can be:
uk_ua: Фільтри бувають:

source: Asynchronous function (:code:`async def my_filter(*args, **kwargs): pass`)
uk_ua: Асинхронною функцією (:code:`async def my_filter(*args, **kwargs): pass`)

source: Synchronous function (:code:`def my_filter(*args, **kwargs): pass`)
uk_ua: Синхронною функцією (:code:`def my_filter(*args, **kwargs): pass`)

source: Anonymous function (:code:`lambda event: True`)
uk_ua: Анонімною функцією (:code:`lambda event: True`)

source: Any awaitable object
uk_ua: Будь-яким очікуваним об'єктом (awaitable object, об'єкт, який може бути використаний в :code:`await` виразі)

source: Subclass of :class:`aiogram.filters.base.Filter`
uk_ua: Підкласом :class:`aiogram.filters.base.Filter`

source: Instances of :ref:`MagicFilter <magic-filters>`
uk_ua: Екземпляром :ref:`MagicFilter <magic-filters>`

source: and should return bool or dict. If the dictionary is passed as result of filter - resulted data will be propagated to the next filters and handler as keywords arguments.
uk_ua: і має повертати bool або dict. Якщо словник передається як результат фільтра, отримані дані будуть передані до наступних фільтрів і обробника як аргументи ключових слів.

source: Base class for own filters
uk_ua: Базовий клас для власних фільтрів

source: If you want to register own filters like builtin filters you will need to write subclass of this class with overriding the :code:`__call__` method and adding filter attributes.
uk_ua: Якщо Ви хочете зареєструвати власні фільтри, як вбудовані фільтри, Вам потрібно буде написати підклас цього класу з заміною методу :code:`__call__` і додаванням атрибутів фільтра.

source: This method should be overridden.
uk_ua: Цей метод слід перевизначити.

source: Accepts incoming event and should return boolean or dict.
uk_ua: Приймає вхідну подію та має повертати логічне (bool) значення або dict.

source: Returns
uk_ua: Повертає

source: Also if you want to extend handler flags with using this filter you should implement this method
uk_ua: Крім того, якщо ви хочете розширити маркери обробника (handler) за допомогою цього фільтра, вам слід реалізувати цей метод

source: Parameters
uk_ua: Параметри

source: existing flags, can be updated directly
uk_ua: існуючі маркери, можна оновити безпосередньо

source: Own filter example
uk_ua: Приклад власного фільтра

source: For example if you need to make simple text filter:
uk_ua: Наприклад, якщо Вам потрібно створити простий текстовий фільтр:

source: Combining Filters
uk_ua: Комбінування фільтрів

source: In general, all filters can be combined in two ways
uk_ua: Взагалом, усі фільтри можна комбінувати двома способами

source: Recommended way
uk_ua: Рекомендований спосіб

source: If you specify multiple filters in a row, it will be checked with an "and" condition:
uk_ua: Якщо Ви вкажете кілька фільтрів поспіль, це буде перевірено умовою "and" :

source: Also, if you want to use two alternative ways to run the same handler ("or" condition) you can register the handler twice or more times as you like
uk_ua: Крім того, якщо ви хочете використовувати два альтернативні способи запуску одного обробника (умова "or"), ви можете зареєструвати обробник двічі або більше разів, як вам подобається

source: Also sometimes you will need to invert the filter result, for example you have an *IsAdmin* filter and you want to check if the user is not an admin
uk_ua: Також іноді Вам потрібно буде інвертувати результат фільтра, наприклад, у вас є фільтр *IsAdmin* і ви хочете перевірити, чи користувач не є адміністратором

source: Another possible way
uk_ua: Інший можливий спосіб

source: An alternative way is to combine using special functions (:func:`and_f`, :func:`or_f`, :func:`invert_f` from :code:`aiogram.filters` module):
uk_ua: Альтернативним способом є об’єднання за допомогою спеціальних функцій (:func:`and_f`, :func:`or_f`, :func:`invert_f` з модуля :code:`aiogram.filters`):
