Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/filters/magic_filters.po
Languages: uk_ua

source: Magic filters
uk_ua: ✨ Магічні 🔮 фільтри ✨

source: This page still in progress. Has many incorrectly worded sentences.
uk_ua: Ця сторінка все ще в розробці. Має багато неправильно сформульованих речень.

source: Is external package maintained by *aiogram* core team.
uk_ua: Це зовнішній пакет, який підтримується основною командою розробки *aiogram*.

source: By default installs with *aiogram* and also is available on `PyPi - magic-filter <https://pypi.org/project/magic-filter/>`_. That's mean you can install it and use with any other libraries and in own projects without depending *aiogram* installed.
uk_ua: За замовчуванням встановлюється разом з *aiogram* і, також, доступний в `PyPi - magic-filter <https://pypi.org/project/magic-filter/>`_. Це означає, що Ви можете встановити його та використовувати з будь-якими іншими бібліотеками та у власних проектах, незалежно від того встановлено *aiogram* чи ні.

source: Usage
uk_ua: Використання

source: The **magic_filter** package implements class shortly named :class:`magic_filter.F` that's mean :code:`F` can be imported from :code:`aiogram` or :code:`magic_filter`. :class:`F` is alias for :class:`MagicFilter`.
uk_ua: Пакет **magic_filter** реалізує клас із короткою назвою :class:`magic_filter.F`, тобто :code:`F` можна імпортувати з :code:`aiogram` або :code:`magic_filter`. :class:`F` є псевдонімом для :class:`MagicFilter`.

source: Note that *aiogram* has an small extension over magic-filter and if you want to use this extension you should import magic from *aiogram* instead of *magic_filter* package
uk_ua: Зауважте, що *aiogram* має невелике розширення для magic-filter, і якщо Ви хочете використовувати це розширення, вам слід імпортувати магію з *aiogram* замість пакета *magic_filter*

source: The :class:`MagicFilter` object is callable, supports :ref:`some actions <magic-filter-possible-actions>` and memorize the attributes chain and the action which should be checked on demand.
uk_ua: Об'єкт классу :class:`MagicFilter` можна викликати, підтримує :ref:`деякі дії <magic-filter-possible-actions>` і запам’ятовує ланцюжок атрибутів і дію, яку слід перевіряти на вимогу.

source: So that's mean you can chain attribute getters, describe simple data validations and then call the resulted object passing single object as argument, for example make attributes chain :code:`F.foo.bar.baz` then add action ':code:`F.foo.bar.baz == 'spam'` and then call the resulted object - :code:`(F.foo.bar.baz == 'spam').resolve(obj)`
uk_ua: Тож це означає, що ви можете ланцюжком отримати атрибути, описати прості перевірки даних, а потім викликати отриманий об’єкт, передаючи один об’єкт як аргумент, наприклад, створити ланцюжок атрибутів :code:`F.foo.bar.baz`, а потім додати дію ':code:`F.foo.bar.baz == 'spam'`, після чого викликати отриманий об'єкт - :code:`(F.foo.bar.baz == 'spam').resolve(obj)`

source: Possible actions
uk_ua: Можливі дії

source: Magic filter object supports some of basic logical operations over object attributes
uk_ua: Об'єкт магічного фільтра підтримує деякі основні логічні операції над атрибутами об'єкта

source: Exists or not None
uk_ua: Атрибут існує, або не "None"

source: Default actions.
uk_ua: Дії за замовчуванням.

source: Equals
uk_ua: Перевірка на однаковість

source: Is one of
uk_ua: Перевірка на приналежність

source: Can be used as method named :code:`in_` or as matmul operator :code:`@` with any iterable
uk_ua: Може використовуватися як метод із назвою :code:`in_` або як оператор matmul :code:`@` з будь-яким ітерованим

source: Contains
uk_ua: Перевірка на наявність

source: String startswith/endswith
uk_ua: Рядок починається/закінчується на

source: Can be applied only for text attributes
uk_ua: Може застосовуватися лише для текстових атрибутів

source: Regexp
uk_ua: Перевірка регулярними виразами

source: Custom function
uk_ua: Власні функції

source: Accepts any callable. Callback will be called when filter checks result
uk_ua: Приймає будь-яку функцію

source: Inverting result
uk_ua: Інвертування результату

source: Any of available operation can be inverted by bitwise inversion - :code:`~`
uk_ua: Будь-яка доступна операція може бути інвертована за допомогою побітової інверсії - :code:`~`

source: Combining
uk_ua: Комбінація

source: All operations can be combined via bitwise and/or operators - :code:`&`/:code:`|`
uk_ua: Усі операції можна комбінувати за допомогою побітових і/або операторів - :code:`&`/:code:`|`

source: Attribute modifiers - string manipulations
uk_ua: Модифікатори атрибутів - маніпуляції з рядками

source: Make text upper- or lower-case
uk_ua: Робить текст верхнім або нижнім регістром

source: Can be used only with string attributes.
uk_ua: Можна використовувати лише з рядковими атрибутами.

source: Get filter result as handler argument
uk_ua: Отримати результат фільтра як аргумент обробника

source: This part is not available in *magic-filter* directly but can be used with *aiogram*
uk_ua: Ця частина недоступна безпосередньо в *magic-filter*, але її можна використовувати з *aiogram*

source: Usage in *aiogram*
uk_ua: Використання в *aiogram*
