Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/filters/text.po
Languages: uk_ua

source: Text
uk_ua: Текст

source: Is useful for filtering text :class:`aiogram.types.message.Message`, any :class:`aiogram.types.callback_query.CallbackQuery` with `data`, :class:`aiogram.types.inline_query.InlineQuery` or :class:`aiogram.types.poll.Poll` question.
uk_ua: Корисно для фільтрації тексту :class:`aiogram.types.message.Message`, будь-якого :class:`aiogram.types.callback_query.CallbackQuery` з `data`, :class:`aiogram.types.inline_query.InlineQuery` або : class:`aiogram.types.poll.Poll` опитування.

source: Only one of `text`, `contains`, `startswith` or `endswith` argument can be used at once. Any of that arguments can be string, list, set or tuple of strings.
uk_ua: Одночасно можна використати лише один із аргументів `text`, `contains`, `startswith` або `endswith` . Будь-який із цих аргументів може бути рядком, списком, набором (set) або кортежем рядків.

source: use :ref:`magic-filter <magic-filters>`. For example do :pycode:`F.text == "text"` instead
uk_ua: використати :ref:`magic-filter <magic-filters>`. Наприклад :pycode:`F.text == "text"` instead

source: Can be imported:
uk_ua: Можна імпортувати:

source: Usage
uk_ua: Використання

source: Text equals with the specified value: :code:`Text(text="text") # value == 'text'`
uk_ua: Текст дорівнює вказаному значенню: :code:`Text(text="text") # value == 'text'`

source: Text starts with the specified value: :code:`Text(startswith="text") # value.startswith('text')`
uk_ua: Текст починається з указаного значення: :code:`Text(startswith="text") # value.startswith('text')`

source: Text ends with the specified value: :code:`Text(endswith="text") # value.endswith('text')`
uk_ua: Текст закінчується вказаним значенням: :code:`Text(endswith="text") # value.endswith('text')`

source: Text contains the specified value: :code:`Text(contains="text") # value in 'text'`
uk_ua: Текст містить вказане значення: :code:`Text(contains="text") # value in 'text'`

source: Any of previous listed filters can be list, set or tuple of strings that's mean any of listed value should be equals/startswith/endswith/contains: :code:`Text(text=["text", "spam"])`
uk_ua: Будь-який із попередніх перерахованих фільтрів може бути списком, набором або кортежем рядків, що означає, що будь-яке значення у списку має дорівнювати/починатися/закінчуватися/містити: :code:`Text(text=["text", "spam"])`

source: Ignore case can be combined with any previous listed filter: :code:`Text(text="Text", ignore_case=True) # value.lower() == 'text'.lower()`
uk_ua: Ігнорування регістру можна поєднати з будь-яким фільтром із попереднього списку: :code:`Text(text="Text", ignore_case=True) # value.lower() == 'text'.lower()`

source: Allowed handlers
uk_ua: Дозволені обробники (handlers)

source: Allowed update types for this filter:
uk_ua: Дозволені типи оновлень для цього фільтра:
