Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/finite_state_machine/index.po
Languages: uk_ua

source: Finite State Machine
uk_ua: Кінцевий автомат (FSM)

source: A finite-state machine (FSM) or finite-state automaton (FSA, plural: automata), finite automaton, or simply a state machine, is a mathematical model of computation.
uk_ua: Кінцевий автомат, кінцевий автоматон, або машина станів (FSM, FSA, finite automaton, state machine) - це математична модель обчислень.

source: It is an abstract machine that can be in exactly one of a finite number of states at any given time. The FSM can change from one state to another in response to some inputs; the change from one state to another is called a transition.
uk_ua: Це абстрактна машина, яка може перебувати в одному зі скінченної кількості станів у будь-який момент часу. Кінцевий автомат може переходити з одного стану в інший у відповідь на деякі вхідні дані; перехід з одного стану в інший називається переходом.

source: An FSM is defined by a list of its states, its initial state, and the inputs that trigger each transition.
uk_ua: Кінцевий автомат визначається списком його станів, початковим станом і вхідними даними, які запускають кожен перехід.

source: Source: `WikiPedia <wiki>`_
uk_ua: Джерело: `WikiPedia <wiki>`_

source: Usage example
uk_ua: Приклад використання

source: Not all functionality of the bot can be implemented as single handler, for example you will need to collect some data from user in separated steps you will need to use FSM.
uk_ua: Не всі функції бота можна реалізувати як єдиний обробник (handler), наприклад, якщо Вам потрібно буде збирати деякі дані від користувача в окремих кроках, вам потрібно буде використовувати FSM.

source: FSM Example
uk_ua: Приклад кінцевого автомату

source: Let's see how to do that step-by-step
uk_ua: Гайда, подивимось як реалізувати це крок за кроком

source: Step by step
uk_ua: Крок за кроком

source: Before handle any states you will need to specify what kind of states you want to handle
uk_ua: Перед обробкою будь-яких станів Вам потрібно буде вказати тип станів, які Ви хочете обробляти

source: And then write handler for each state separately from the start of dialog
uk_ua: А потім напишіть обробник (handler) для кожного стану окремо від початку діалогу

source: Here is dialog can be started only via command :code:`/start`, so lets handle it and make transition user to state :code:`Form.name`
uk_ua: Тут діалог можна почати лише за допомогою команди :code:`/start`, тому давайте обробимо її та зробимо перехід користувача до стану :code:`Form.name`

source: After that you will need to save some data to the storage and make transition to next step.
uk_ua: Після цього Вам потрібно буде зберегти деякі дані в пам’яті та перейти до наступного кроку.

source: At the next steps user can make different answers, it can be `yes`, `no` or any other
uk_ua: На наступних кроках користувач може дати різні відповіді, це може бути «так», «ні» або будь-що інше

source: Handle :code:`yes` and soon we need to handle :code:`Form.language` state
uk_ua: Обробка :code:`yes` і скоро нам потрібно буде обробити стан :code:`Form.language`

source: Handle :code:`no`
uk_ua: Обробка :code:`no`

source: And handle any other answers
uk_ua: І обробка будь-яких інших відповідей

source: All possible cases of `like_bots` step was covered, let's implement finally step
uk_ua: Всі можливі випадки кроку `like_bots` було розглянуто, нумо реалізуємо останній крок

source: And now you have covered all steps from the image, but you can make possibility to cancel conversation, lets do that via command or text
uk_ua: І тепер Ви виконали всі кроки на зображенні, але ви можете зробити можливість скасувати діалог, давайте зробимо це за допомогою команди або тексту

source: Complete example
uk_ua: Повний приклад

source: Read more
uk_ua: Читайте також
