Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/finite_state_machine/scene.po
Languages: uk_ua

source: Scenes Wizard
uk_ua: Майcтер сцен

source: This feature is experimental and may be changed in future versions.
uk_ua: Дана фіча є експериментальною, тому у наступних оновленнях може змінюватись.

source: **aiogram's** basics API is easy to use and powerful, allowing the implementation of simple interactions such as triggering a command or message for a response. However, certain tasks require a dialogue between the user and the bot. This is where Scenes come into play.
uk_ua: Базовий інтерфейс **aiogram**-у простий та потужний у використанні, що дозволяє реалізувати прості взаємодії, такі як обробка команд або повідомлень і відповідей. Однак деякі завдання вимагають поетапного діалогу між користувачем і ботом. Ось де сцени вступають у гру.

source: Understanding Scenes
uk_ua: Що ж таке сцени?

source: A Scene in **aiogram** is like an abstract, isolated namespace or room that a user can be ushered into via the code. When a user is within a Scene, most other global commands or message handlers are bypassed, unless they are specifically designed to function outside of the Scenes. This helps in creating an experience of focused interactions. Scenes provide a structure for more complex interactions, effectively isolating and managing contexts for different stages of the conversation. They allow you to control and manage the flow of the conversation in a more organized manner.
uk_ua: Сцена в **aiogram** схожа на абстрактний, ізольований простір імен або кімнату, до якої користувач може потрапити за допомогою коду. Коли користувач перебуває в межах Сцени, більшість інших глобальних команд або обробників повідомлень пропускаються, якщо тільки вони не призначені для роботи поза Сценами.Сцени забезпечують структуру для більш складних взаємодій, ефективно ізолюючи та керуючи контекстами для різних етапів розмови. Вони дозволяють більш організовано контролювати та керувати розмовою.

source: Scene Lifecycle
uk_ua: Життєвий цикл

source: Each Scene can be "entered", "left" of "exited", allowing for clear transitions between different stages of the conversation. For instance, in a multi-step form filling interaction, each step could be a Scene - the bot guides the user from one Scene to the next as they provide the required information.
uk_ua: У кожну сцену можна "увійти", "покинути" або "вийти", що забезпечує чіткі переходи між різними етапами розмови. Наприклад, у багатоетапній взаємодії заповнення форми кожен крок може бути сценою - бот направляє користувача від однієї сцени до наступної, коли вони надають необхідну інформацію.

source: Scene Listeners
uk_ua: Слухачі подій

source: Scenes have their own hooks which are command or message listeners that only act while the user is within the Scene. These hooks react to user actions while the user is 'inside' the Scene, providing the responses or actions appropriate for that context. When the user is ushered from one Scene to another, the actions and responses change accordingly as the user is now interacting with the set of listeners inside the new Scene. These 'Scene-specific' hooks or listeners, detached from the global listening context, allow for more streamlined and organized bot-user interactions.
uk_ua: Сцени мають власні хуки, які є слухачами команд або повідомлень, які діють лише тоді, коли користувач знаходиться всередині сцени. Ці хуки реагують на дії користувача, коли користувач перебуває «всередині» Сцени, надаючи відповіді або дії, відповідні цьому контексту. Коли користувач переходить від однієї сцени до іншої, дії та відповіді відповідно змінюються, оскільки користувач тепер взаємодіє з групою слухачів у новій сцені. Ці «специфічні для сцени» хуки або слухачі, відірвані від глобального контексту прослуховування, дозволяють більш оптимізовану та організовану взаємодію бот-користувач.

source: Scene Interactions
uk_ua: Взаємодія

source: Each Scene is like a self-contained world, with interactions defined within the scope of that Scene. As such, only the handlers defined within the specific Scene will react to user's input during the lifecycle of that Scene.
uk_ua: Кожна сцена схожа на самодостатній світ із взаємодіями, визначеними в межах цієї сцени. Таким чином, лише обробники, визначені в конкретній сцені, реагуватимуть на введення користувача протягом життєвого циклу цієї сцени.

source: Scene Benefits
uk_ua: Переваги

source: Scenes can help manage more complex interaction workflows and enable more interactive and dynamic dialogs between the user and the bot. This offers great flexibility in handling multi-step interactions or conversations with the users.
uk_ua: Сцени можуть допомогти керувати більш складними робочими процесами взаємодії та забезпечити більш інтерактивні та динамічні діалоги між користувачем і ботом. Це забезпечує велику гнучкість у обробці багатоетапних взаємодій або розмов з користувачами.

source: How to use Scenes
uk_ua: Як це використовувати?

source: For example we have a quiz bot, which asks the user a series of questions and then displays the results.
uk_ua: Наприклад, у нас є тестовий бот, який задає користувачеві серію запитань, а потім відображає результати - назвемо його гра-вікторина.

source: Lets start with the data models, in this example simple data models are used to represent the questions and answers, in real life you would probably use a database to store the data.
uk_ua: Почнемо з моделей даних. У цьому прикладі прості моделі даних використовуються для представлення запитань і відповідей, у реальному житті ви, ймовірно, використовували б базу даних для зберігання даних.

source: Questions list
uk_ua: Запитання

source: Then, we need to create a Scene class that will represent the quiz game scene:
uk_ua: Потім нам потрібно створити клас Scene, який представлятиме сцену вікторини:

source: Keyword argument passed into class definition describes the scene name - is the same as state of the scene.
uk_ua: Іменований аргумент, переданий у визначення класу, описує ім'я сцени - те саме, що стан сцени.

source: Quiz Scene
uk_ua: Сцена вікторини

source: Also we need to define a handler that helps to start the quiz game:
uk_ua: Також нам потрібно визначити обробник, який допоможе запустити вікторину:

source: Start command handler
uk_ua: Обробник для запуску вікторини

source: Once the scene is defined, we need to register it in the SceneRegistry:
uk_ua: Після визначення сцени нам потрібно зареєструвати її в SceneRegistry:

source: Registering the scene
uk_ua: Реєстрація сцени

source: So, now we can implement the quiz game logic, each question is sent to the user one by one, and the user's answer is checked at the end of all questions.
uk_ua: Отже, тепер ми можемо реалізувати логіку гри-вікторини, кожне запитання надсилається користувачеві одне за одним, а відповідь користувача перевіряється в кінці всіх запитань.

source: Now we need to write an entry point for the question handler:
uk_ua: Тепер нам потрібно написати точку входу для обробника запитань:

source: Question handler entry point
uk_ua: Точка входу обробника запитань

source: Once scene is entered, we should expect the user's answer, so we need to write a handler for it, this handler should expect the text message, save the answer and retake the question handler for the next question:
uk_ua: Після входу в сцену ми маємо очікувати відповіді користувача, тому нам потрібно написати для неї обробник, цей обробник має очікувати текстове повідомлення, зберегти відповідь і повторно виконати обробник запитання для наступного запитання:

source: Answer handler
uk_ua: Обробник відповідей

source: When user answer with unknown message, we should expect the text message again:
uk_ua: Коли користувач відповідає невідомим повідомленням, ми повинні знову очікувати текстове повідомлення:

source: Unknown message handler
uk_ua: Невідомий обробник повідомлень

source: When all questions are answered, we should show the results to the user, as you can see in the code below, we use `await self.wizard.exit()` to exit from the scene when questions list is over in the `QuizScene.on_enter` handler.
uk_ua: Після відповіді на всі запитання ми маємо показати результати користувачеві, як ви можете бачити в коді нижче, ми використовуємо `await self.wizard.exit()`, щоб вийти зі сцени, коли список запитань у `QuizScene» закінчено .on_enter` обробник.

source: Thats means that we need to write an exit handler to show the results to the user:
uk_ua: Це означає, що нам потрібно написати обробник виходу, щоб показати результати користувачеві:

source: Show results handler
uk_ua: Обробник показу результатів

source: Also we can implement a actions to exit from the quiz game or go back to the previous question:
uk_ua: Також ми можемо виконати дії для виходу з вікторини або повернення до попереднього запитання:

source: Exit handler
uk_ua: Обробник виходу

source: Back handler
uk_ua: Обробник дії "повернутись"

source: Now we can run the bot and test the quiz game:
uk_ua: Тепер ми можемо запустити бота і протестувати гру-вікторину:

source: Run the bot
uk_ua: Запустіть бота

source: Complete them all
uk_ua: Зберемо все разом

source: Quiz Example
uk_ua: Приклад вікторини

source: Components
uk_ua: Компоненти

source: :class:`aiogram.fsm.scene.Scene` - represents a scene, contains handlers
uk_ua: :class:`aiogram.fsm.scene.Scene` - представляє сцену, містить обробники

source: :class:`aiogram.fsm.scene.SceneRegistry` - container for all scenes in the bot, used to register scenes and resolve them by name
uk_ua: :class:`aiogram.fsm.scene.SceneRegistry` - контейнер для всіх сцен у боті, використовується для реєстрації сцен та їх вирішення за назвою

source: :class:`aiogram.fsm.scene.ScenesManager` - manages scenes for each user, used to enter, leave and resolve current scene for user
uk_ua: :class:`aiogram.fsm.scene.ScenesManager` - керує сценами для кожного користувача, використовується для входу, виходу та вирішення поточної сцени для користувача

source: :class:`aiogram.fsm.scene.SceneConfig` - scene configuration, used to configure scene
uk_ua: :class:`aiogram.fsm.scene.SceneConfig` - конфігурація сцени, використовується для налаштування сцени

source: :class:`aiogram.fsm.scene.SceneWizard` - scene wizard, used to interact with user in scene from active scene handler
uk_ua: :class:`aiogram.fsm.scene.SceneWizard` - майстер сцени, який використовується для взаємодії з користувачем у сцені з активного обробника сцени

source: Markers - marker for scene handlers, used to mark scene handlers
uk_ua: Markers - маркер для обробників сцен, використовується для позначення обробників сцен

source: Represents a scene in a conversation flow.
uk_ua: Представляє крок в діалозі.

source: A scene is a specific state in a conversation where certain actions can take place.
uk_ua: Сцена — це певний стан розмови, де можуть відбуватися певні дії.

source: Each scene has a set of filters that determine when it should be triggered, and a set of handlers that define the actions to be executed when the scene is active.
uk_ua: Кожна сцена має набір фільтрів, які визначають, коли вона має бути запущена, і набір обробників, які визначають дії, які мають виконуватися, коли сцена активна.

source: This class is not meant to be used directly. Instead, it should be subclassed to define custom scenes.
uk_ua: Цей клас не призначений для безпосереднього використання. Замість цього слід створити підкласи для визначення власних сцен.

source: Adds the scene to the given router.
uk_ua: Додає сцену до заданого маршрутизатора.

source: Parameters
uk_ua: Параметри

source: Returns
uk_ua: Повертає

source: Create an entry point handler for the scene, can be used to simplify the handler that starts the scene.
uk_ua: Створіть обробник точки входу для сцени, який можна використовувати для спрощення обробника, який запускає сцену.

source: new router
uk_ua: новий роутер

source: A class that represents a registry for scenes in a Telegram bot.
uk_ua: Клас, який представляє реєстр для сцен.

source: This method adds the specified scenes to the registry and optionally registers it to the router.
uk_ua: Цей метод додає вказані сцени до реєстру та додатково реєструє їх на маршрутизаторі.

source: If a scene with the same state already exists in the registry, a SceneException is raised.
uk_ua: Якщо сцена з таким самим станом уже існує в реєстрі, виникає SceneException.

source: A variable length parameter that accepts one or more types of scenes. These scenes are instances of the Scene class.
uk_ua: Параметр змінної довжини, який приймає один або кілька типів сцен. Ці сцени є екземплярами класу Scene.

source: An optional parameter that specifies the router to which the scenes should be added.
uk_ua: Додатковий параметр, який визначає маршрутизатор, до якого слід додати сцени.

source: This method returns the registered Scene object for the specified scene. The scene parameter can be either a Scene object or a string representing the name of the scene. If a Scene object is provided, the state attribute of the SceneConfig object associated with the Scene object will be used as the scene name. If None or an invalid type is provided, a SceneException will be raised.
uk_ua: Цей метод повертає зареєстрований об’єкт Scene для вказаної сцени. Параметром сцени може бути або об’єкт Scene, або рядок, що представляє назву сцени. Якщо надається об’єкт Scene, атрибут стану об’єкта SceneConfig, пов’язаного з об’єктом Scene, використовуватиметься як ім’я сцени. Якщо вказано None або недійсний тип, буде викликано SceneException.

source: If the specified scene is not registered in the SceneRegistry object, a SceneException will be raised.
uk_ua: Якщо вказану сцену не зареєстровано в об’єкті SceneRegistry, буде породжено помилку SceneException.

source: A Scene object or a string representing the name of the scene.
uk_ua: Об’єкт Scene або рядок, що представляє назву сцени.

source: The registered Scene object corresponding to the given scene parameter.
uk_ua: Зареєстрований об’єкт Scene, що відповідає даному параметру сцени.

source: Registers one or more scenes to the SceneRegistry.
uk_ua: Реєструє одну або кілька сцен у SceneRegistry.

source: One or more scene classes to register.
uk_ua: Один або кілька класів сцен для реєстрації.

source: The ScenesManager class is responsible for managing scenes in an application. It provides methods for entering and exiting scenes, as well as retrieving the active scene.
uk_ua: Клас ScenesManager відповідає за керування сценами в програмі. Він надає методи входу та виходу зі сцен, а також відновлення активної сцени.

source: Close method is used to exit the currently active scene in the ScenesManager.
uk_ua: Метод Close використовується для виходу з поточної активної сцени в ScenesManager.

source: Additional keyword arguments passed to the scene's exit method.
uk_ua: Додаткові аргументи ключового слова, передані в метод виходу сцени.

source: Enters the specified scene.
uk_ua: Виходить на вказану сцену.

source: Optional Type[Scene] or str representing the scene type to enter.
uk_ua: Додатково Type[Scene] або str, що представляє тип сцени, який потрібно ввести.

source: Optional bool indicating whether to check if there is an active scene to exit before entering the new scene. Defaults to True.
uk_ua: Необов’язковий параметр, що вказує, чи перевіряти наявність активної сцени для виходу перед входом у нову сцену. За замовчуванням значення True.

source: Additional keyword arguments to pass to the scene's wizard.enter() method.
uk_ua: Додаткові іменовані аргументи для передачі в метод wizard.enter() сцени.

source: Scene actions
uk_ua: Дії сцени

source: Allow callback query without state
uk_ua: Створювати обробники кнопок без перевірки стану поточної сцени

source: Scene handlers
uk_ua: Обробники сцени

source: Reset scene data on enter
uk_ua: Скинути дані сцени після входу

source: Reset scene history on enter
uk_ua: Скинути історію сцени під час входу

source: Scene state
uk_ua: Стан сцени

source: A class that represents a wizard for managing scenes in a Telegram bot.
uk_ua: Клас, який представляє майстер сцен.

source: Instance of this class is passed to each scene as a parameter. So, you can use it to transition between scenes, get and set data, etc.
uk_ua: Екземпляр цього класу передається кожній сцені як параметр. Отже, ви можете використовувати його для переходу між сценами, отримання та встановлення даних тощо.

source: This class is not meant to be used directly. Instead, it should be used as a parameter in the scene constructor.
uk_ua: Цей клас не призначений для безпосереднього використання. Натомість його слід використовувати як параметр у конструкторі сцени.

source: This method is used to go back to the previous scene.
uk_ua: Цей метод використовується для повернення до попередньої сцени.

source: Keyword arguments that can be passed to the method.
uk_ua: Аргументи ключових слів, які можна передати в метод.

source: Clears the data.
uk_ua: Очищає дані.

source: Enter method is used to transition into a scene in the SceneWizard class. It sets the state, clears data and history if specified, and triggers entering event of the scene.
uk_ua: Метод Enter використовується для переходу в сцену в класі SceneWizard. Він встановлює стан, очищає дані та історію, якщо вказано, і запускає введення події сцени.

source: Additional keyword arguments.
uk_ua: Додаткові іменовані аргументи.

source: Exit the current scene and enter the default scene/state.
uk_ua: Вийти з поточної сцени та перейти до стандартного стану чи сцени.

source: This method returns the data stored in the current state.
uk_ua: Цей метод повертає дані, що зберігаються в поточному стані.

source: A dictionary containing the data stored in the scene state.
uk_ua: Словник, що містить дані, що зберігаються в стані сцени.

source: The `goto` method transitions to a new scene. It first calls the `leave` method to perform any necessary cleanup in the current scene, then calls the `enter` event to enter the specified scene.
uk_ua: Метод `goto` переходить до нової сцени. Спочатку він викликає метод `leave`, щоб виконати будь-яке необхідне очищення в поточній сцені, а потім викликає подію `enter`, щоб увійти до вказаної сцени.

source: The scene to transition to. Can be either a `Scene` instance or a string representing the scene.
uk_ua: Сцена для переходу. Може бути екземпляром `Scene` або рядком, що представляє сцену.

source: Additional keyword arguments to pass to the `enter` method of the scene manager.
uk_ua: Додаткові іменовані аргументи для точки входу до `enter` менеджера сцен.

source: Leaves the current scene. This method is used to exit a scene and transition to the next scene.
uk_ua: Залишає поточну сцену. Цей метод використовується для виходу зі сцени та переходу до наступної сцени.

source: Whether to include history in the snapshot. Defaults to True.
uk_ua: Чи включати історію в знімок. За замовчуванням значення True.

source: This method allows to re-enter the current scene.
uk_ua: Цей метод дозволяє повторно увійти до поточної сцени.

source: Additional keyword arguments to pass to the scene.
uk_ua: Додаткові іменовані аргументи для передачі до сцени.

source: Sets custom data in the current state.
uk_ua: Встановлює настроювані дані в поточний стан.

source: A dictionary containing the custom data to be set in the current state.
uk_ua: Словник, що містить настроювані дані, які потрібно встановити в поточному стані.

source: This method updates the data stored in the current state
uk_ua: Цей метод оновлює дані, що зберігаються в поточному стані

source: Optional dictionary of data to update.
uk_ua: Додатковий словник даних для оновлення.

source: Additional key-value pairs of data to update.
uk_ua: Додаткові пари ключ-значення даних для оновлення.

source: Dictionary of updated data
uk_ua: Словник оновлених даних

source: Markers
uk_ua: Маркери

source: Markers are similar to the Router event registering mechanism, but they are used to mark scene handlers in the Scene class.
uk_ua: Маркери подібні до механізму реєстрації подій Router, але вони використовуються для позначення обробників сцени в класі Scene.

source: It can be imported from :code:`from aiogram.fsm.scene import on` and should be used as decorator.
uk_ua: Його можна імпортувати з :code:`from aiogram.fsm.scene import on` і слід використовувати як декоратор.

source: Allowed event types:
uk_ua: Дозволені типи подій:

source: Each event type can be filtered in the same way as in the Router.
uk_ua: Кожен тип події можна відфільтрувати так само, як і в маршрутизаторі.

source: Also each event type can be marked as scene entry point, exit point or leave point.
uk_ua: Також кожен тип події можна позначити як точку входу в сцену, точку виходу або точку переходу.

source: If you want to mark the scene can be entered from message or inline query, you should use :code:`on.message` or :code:`on.inline_query` marker:
uk_ua: Якщо ви хочете позначити, що до сцени можна потрапити з повідомлення або ін-лайн кнопки, вам слід використовувати маркер :code:`on.message` або :code:`on.inline_query`:

source: Scene has only tree points for transitions:
uk_ua: Сцени мають три точки для переходів:

source: enter point - when user enters to the scene
uk_ua: Точка входу - коли користувач входить до сцени

source: leave point - when user leaves the scene and the enter another scene
uk_ua: Точка переходу - коли користувач переходить до іншої сцени

source: exit point - when user exits from the scene
uk_ua: Точка виходу - коли користувач завершує сцену
