Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/finite_state_machine/storages.po
Languages: uk_ua

source: Storages
uk_ua: Сховища

source: Storages out of the box
uk_ua: Вбудоване сховище

source: Default FSM storage, stores all data in :class:`dict` and loss everything on shutdown
uk_ua: Сховище кінцевого автомату за замовчуванням, зберігає всі дані в :class:`dict` і забуває все під час вимкнення

source: Is not recommended using in production in due to you will lose all data when your bot restarts
uk_ua: Не рекомендується використовувати на production, оскільки, Ви втратите всі дані під час перезапуску бота

source: Keys inside storage can be customized via key builders:
uk_ua: Ключі всередині сховища можна налаштувати за допомогою конструкторів ключів:

source: Writing own storages
uk_ua: Написання власних сховищ

source: Base class for all FSM storages
uk_ua: Основний клас для всіх сховищ кінцевого автомату

source: Set state for specified key
uk_ua: Установити стан для вказаного ключа

source: Parameters
uk_ua: Параметри

source: instance of the current bot
uk_ua: екземпляр поточного бота

source: storage key
uk_ua: ключ сховища

source: new state
uk_ua: новий стан

source: Get key state
uk_ua: Отримання стану ключа

source: Returns
uk_ua: Повертає

source: current state
uk_ua: поточний стан

source: Write data (replace)
uk_ua: Запис даних (заміна)

source: new data
uk_ua: нові дані

source: Get current data for key
uk_ua: Отримання поточних даних для ключа

source: current data
uk_ua: нинішні дані

source: Update date in the storage for key (like dict.update)
uk_ua: Дата оновлення в сховищі для ключа (наприклад, dict.update)

source: partial data
uk_ua: неповні дані

source: Close storage (database connection, file or etc.)
uk_ua: Закриття сховища (підключення до бази даних, файлу тощо)
