Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/utils/callback_answer.po
Languages: uk_ua

source: Callback answer
uk_ua: Відповідь на зворотний дзвінок

source: Helper for callback query handlers, can be useful in bots with a lot of callback handlers to automatically take answer to all requests.
uk_ua: Помічник для обробників запитів зворотного виклику, може бути корисним у роботах із великою кількістю обробників коллбек виклику, щоб автоматично відповідати на всі запити.

source: Simple usage
uk_ua: Просте використання

source: For use, it is enough to register the inner middleware :class:`aiogram.utils.callback_answer.CallbackAnswerMiddleware` in dispatcher or specific router:
uk_ua: Для використання достатньо зареєструвати внутрішній мідлварь :class:`aiogram.utils.callback_answer.CallbackAnswerMiddleware в диспетчері або окремому маршрутизаторі:

source: After that all handled callback queries will be answered automatically after processing the handler.
uk_ua: Після цього на всі оброблені запити зворотного виклику буде автоматично відповідати після обробки обробника.

source: Advanced usage
uk_ua: Розширене використання

source: In some cases you need to have some non-standard response parameters, this can be done in several ways:
uk_ua: У деяких випадках потрібно мати якісь нестандартні параметри відповіді, це можна зробити кількома способами:

source: Global defaults
uk_ua: Глобальні параметри за замовчуванням

source: Change default parameters while initializing middleware, for example change answer to `pre` mode and text "OK":
uk_ua: Змініть параметри за замовчуванням під час ініціалізації мідлваря, наприклад, змініть відповідь на режим `pre` і надішліть текст "OK":

source: Look at :class:`aiogram.utils.callback_answer.CallbackAnswerMiddleware` to get all available parameters
uk_ua: Перегляньте :class:`aiogram.utils.callback_answer.CallbackAnswerMiddleware`, щоб отримати всі доступні параметри

source: Handler specific
uk_ua: Особливий обробник

source: By using :ref:`flags <flags>` you can change the behavior for specific handler
uk_ua: За допомогою :ref:`flags <flags>` ви можете змінити поведінку для певних обробник

source: Flag arguments is the same as in :class:`aiogram.utils.callback_answer.CallbackAnswerMiddleware` with additional one :code:`disabled` to disable answer.
uk_ua: Аргументи прапора такі самі, як у :class:`aiogram.utils.callback_answer.CallbackAnswerMiddleware` з додатковим :code:`disabled` для вимкнення відповіді.

source: A special case
uk_ua: Особливий випадок

source: It is not always correct to answer the same in every case, so there is an option to change the answer inside the handler. You can get an instance of :class:`aiogram.utils.callback_answer.CallbackAnswer` object inside handler and change whatever you want.
uk_ua: Не завжди правильно відповідати однаково в кожному випадку, тому в обробнику є можливість змінити відповідь. Ви можете отримати екземпляр об’єкта :class:`aiogram.utils.callback_answer.CallbackAnswer` всередині обробника та змінити все, що забажаєте.

source: Note that is impossible to change callback answer attributes when you use :code:`pre=True` mode.
uk_ua: Зауважте, що неможливо змінити атрибути відповіді зворотного виклику під час використання :code:`pre=True` mode.

source: Combine that all at once
uk_ua: Об’єднайте все разом

source: For example you want to answer in most of cases before handler with text "🤔" but at some cases need to answer after the handler with custom text, so you can do it:
uk_ua: Наприклад, у більшості випадків ви хочете відповісти перед обробником із текстом "🤔", але в деяких випадках потрібно відповісти після обробника з настроюваним текстом, тому ви можете це зробити ось так:

source: Description of objects
uk_ua: Опис об'єктів

source: Bases: :py:class:`~aiogram.dispatcher.middlewares.base.BaseMiddleware`
uk_ua: Базовий: :py:class:`~aiogram.dispatcher.middlewares.base.BaseMiddleware`

source: Inner middleware for callback query handlers, can be useful in bots with a lot of callback handlers to automatically take answer to all requests
uk_ua: Внутрішній мідлварь для обробників запитів зворотного виклику, може бути корисним у роботах із великою кількістю обробників зворотного виклику, щоб автоматично відповідати на всі запити

source: Parameters
uk_ua: Параметри

source: send answer before execute handler
uk_ua: відправити відповідь перед виконанням обробника

source: show alert
uk_ua: показати сповіщення

source: game url
uk_ua: URL-адрес гри

source: cache answer for some time
uk_ua: кешувати відповідь на деякий час

source: Bases: :py:class:`object`
uk_ua: Базовий :py:class:`object`

source: Callback answer configuration
uk_ua: Конфігурація відповіді на зворотний дзвінок

source: this request is already answered by middleware
uk_ua: на цей запит уже відповідає мідлварь

source: answer will not be performed
uk_ua: відповідь не буде виконано

source: Deactivate answering for this handler
uk_ua: Вимкніть відповіді для цього обробника

source: Indicates that automatic answer is disabled in this handler
uk_ua: Вказує, що автоматичну відповідь вимкнено в цьому обробнику

source: Indicates that request is already answered by middleware
uk_ua: Вказує, що мідлварь вже відповідає на запит

source: Response text :return:
uk_ua: Текст відповіді :return:

source: Whether to display an alert
uk_ua: Чи відображати сповіщення

source: Game url
uk_ua: URL-адрес гри

source: Response cache time
uk_ua: Час кешу відповіді
