Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/utils/chat_action.po
Languages: uk_ua

source: Chat action sender
uk_ua: Відправник дій у чаті

source: Sender
uk_ua: Відправник

source: This utility helps to automatically send chat action until long actions is done to take acknowledge bot users the bot is doing something and not crashed.
uk_ua: Ця утиліта допомагає автоматично надсилати дії чату, допоки виконуються тривалі дії боттом,щоб повідомити користувачів бота про те що бот щось робить і не завершив роботу аварійно.

source: Provides simply to use context manager.
uk_ua: Надає простий для використання контекстний менеджер.

source: Technically sender start background task with infinity loop which works until action will be finished and sends the `chat action <https://core.telegram.org/bots/api#sendchataction>`_ every 5 seconds.
uk_ua: Технічно, відправник запускає фонову завдачу з нескінченним циклом, який працює до завершення дії та надсилає `дію чату <https://core.telegram.org/bots/api#sendchataction>`_ кожні 5 секунд.

source: Parameters
uk_ua: Параметри

source: instance of the bot
uk_ua: екземпляр бота, необов'язковий параметр

source: target chat id
uk_ua: ідентифікатор цільового чату

source: chat action type
uk_ua: тип дії

source: interval between iterations
uk_ua: інтервал між ітераціями

source: Create instance of the sender with `choose_sticker` action
uk_ua: Створення екземпляру відправника з дією `choose_sticker`

source: Create instance of the sender with `find_location` action
uk_ua: Створення екземпляру відправника з дією `find_location`

source: Create instance of the sender with `record_video` action
uk_ua: Створення екземпляру відправника з дією `record_video`

source: Create instance of the sender with `record_video_note` action
uk_ua: Створення екземпляру відправника з дією `record_video_note`

source: Create instance of the sender with `record_voice` action
uk_ua: Створення екземпляру відправника з дією `record_voice`

source: Create instance of the sender with `typing` action
uk_ua: Створення екземпляру відправника з дією `typing`

source: Create instance of the sender with `upload_document` action
uk_ua: Створення екземпляру відправника з дією `upload_document`

source: Create instance of the sender with `upload_photo` action
uk_ua: Створення екземпляру відправника з дією `upload_photo`

source: Create instance of the sender with `upload_video` action
uk_ua: Створення екземпляру відправника з дією `upload_video

source: Create instance of the sender with `upload_video_note` action
uk_ua: Створення екземпляру відправника з дією `upload_video_note`

source: Create instance of the sender with `upload_voice` action
uk_ua: Створення екземпляру відправника з дією `upload_voice`

source: Usage
uk_ua: Використання

source: Middleware
uk_ua: Проміжні програми

source: Helps to automatically use chat action sender for all message handlers
uk_ua: Допомагає автоматично використовувати відправника дій чату для всіх обробників повідомлень

source: Before usa should be registered for the `message` event
uk_ua: Перед використанням слід зареєструвати для події `message`

source: After this action all handlers which works longer than `initial_sleep` will produce the '`typing`' chat action.
uk_ua: Після цього всі обробники, що працюють довше за `initial_sleep`, виконуватимуть дію '`typing`' чату

source: Also sender can be customized via flags feature for particular handler.
uk_ua: Також відправник може бути налаштованим за допомогою функції міток для певного обробника.

source: Change only action type:
uk_ua: Зміна лише типу дії:

source: Change sender configuration:
uk_ua: Зміна конфігурації відправника:
