Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/utils/i18n.po
Languages: uk_ua

source: Translation
uk_ua: Переклад

source: In order to make you bot translatable you have to add a minimal number of hooks to your Python code.
uk_ua: Для того, щоб Ваш бот володів декількома мовами, необхідно додати мінімальну кількість хуків до вашого Python коду

source: These hooks are called translation strings.
uk_ua: Ці хуки звуться рядками передкладу

source: The aiogram translation utils is build on top of `GNU gettext Python module <https://docs.python.org/3/library/gettext.html>`_ and `Babel library <http://babel.pocoo.org/en/latest/>`_.
uk_ua: Утиліти перекладу побудовані на основі модулю `GNU gettext Python <https://docs.python.org/3/library/gettext.html>`_ і `Babel library <http://babel.pocoo.org/en/latest/>`_.

source: Installation
uk_ua: Встановлення

source: Babel is required to make simple way to extract translation strings from your code
uk_ua: Babel потрібний для забезпечення простоти експорту рядків перекладу з Вашого коду.

source: Can be installed from pip directly:
uk_ua: Можна встановити безпосередньо з pip:

source: or as `aiogram` extra dependency:
uk_ua: чи як додаткову залежність `aiogram`:

source: Make messages translatable
uk_ua: Як зробити повідомлення перекладаваними?

source: In order to gettext need to know what the strings should be translated you will need to write translation strings.
uk_ua: Для того, щоб gettext знав які рядки слід перекласти, Вам необхідно відмітити рядки перекладу.

source: For example:
uk_ua: Наприклад:

source: f-strings can't be used as translations string because any dynamic variables should be added to message after getting translated message
uk_ua: f-рядки не можна використовувати як рядки перекладу, оскільки будь-які динамічні змінні слід додати до повідомлення після отримання перекладеного повідомлення

source: Also if you want to use translated string in keyword- or magic- filters you will need to use lazy gettext calls:
uk_ua: Крім того, якщо Ви бажаєте використати перекладений рядок у фільтрах, Вам треба використати відкладений переклад (lazy gettext):

source: Lazy gettext calls should always be used when the current language is not know at the moment
uk_ua: Відкладені виклики gettext слід завжди використовувати, коли поточна мова на даний момент невідома.

source: Lazy gettext can't be used as value for API methods or any Telegram Object (like :class:`aiogram.types.inline_keyboard_button.InlineKeyboardButton` or etc.)
uk_ua: Відкладені виклики gettext не можна використовувати як значення для методів API або будь-якого об’єкта Telegram (наприклад, :class:`aiogram.types.inline_keyboard_button.InlineKeyboardButton` тощо)

source: Configuring engine
uk_ua: Налаштування рушія

source: After you messages is already done to use gettext your bot should know how to detect user language
uk_ua: Коли ваші повідомлення вже готові використовувати gettext, Ваш бот повинен знати, як визначити мову користувача.

source: On top of your application the instance of :class:`aiogram.utils.i18n.I18n` should be created
uk_ua: Поруч з місцем ініціалізації диспетчера має бути створений екземпляр перекладача:class:`aiogram.utils.i18n.I18n`.

source: After that you will need to choose one of builtin I18n middleware or write your own.
uk_ua: Після цього Вам потрібно буде вибрати одну з вбудованих проміжних програм (middleware) I18n або написати власну.

source: Builtin middlewares:
uk_ua: Вбудовані проміжні програми:

source: Simple I18n middleware.
uk_ua: Проста I18n проміжна програма.

source: Chooses language code from the User object received in event
uk_ua: Вибирає код мови з об’єкта User, отриманого в події.

source: Create an instance of middleware
uk_ua: Створення екземпляру проміжної програми.

source: Parameters
uk_ua: Параметри

source: instance of I18n
uk_ua: екземпляр I18n

source: context key for I18n instance
uk_ua: ключ (назва ключа) екземпляру I18n в контексті

source: context key for this middleware
uk_ua: контекстний ключ для цієї проміжної програми

source: Const middleware chooses statically defined locale
uk_ua: Проміжна програма Const вибирає статично визначену локаль.

source: This middleware stores locale in the FSM storage
uk_ua: Ця проміжна програма зберігає локаль у сховищі FSM.

source: Write new locale to the storage
uk_ua: Запис нової локалі у сховище

source: instance of FSMContext
uk_ua: екземпляр FSMContext

source: new locale
uk_ua: нова локаль

source: or define you own based on abstract I18nMiddleware middleware:
uk_ua: або визначте вашу власну проміжну програму, основану на абстракції I18nMiddleware:

source: Abstract I18n middleware.
uk_ua: Абстракція проміжної програми I18n

source: Detect current user locale based on event and context.
uk_ua: Визначення поточної мови користувача на основі події та контексту.

source: **This method must be defined in child classes**
uk_ua: **Цей метод повинен бути перевизначеним у дочірніх класах**

source: Returns
uk_ua: Повертає

source: Register middleware for all events in the Router
uk_ua: Реєстрація проміжної програми для всіх подій у Роутері

source: Deal with Babel
uk_ua: Працюємо з Babel

source: Step 1 Extract messages
uk_ua: Крок 1: Видобування текстів

source: Here is :code:`--input-dirs=.` - path to code and the :code:`locales/messages.pot` is template where messages will be extracted and `messages` is translation domain.
uk_ua: Де :code:`--input-dirs=.`- шлях до коду, :code:`locales/messages.pot` — це шаблон, куди витягуватимуться повідомлення, а `messages` — домен перекладу.

source: Some useful options:
uk_ua: Деякі корисні опції:

source: Add comments for translators, you can use another tag if you want (TR) :code:`--add-comments=NOTE`
uk_ua: Для додавання коментарів для перекладачів, ви можете використовувати інший тег, якщо хочете (TR) :code:`--add-comments=NOTE`

source: Disable comments with string location in code :code:`--no-location`
uk_ua: Вимкнути коментарі з розташуванням рядків у коді :code:`--no-location`

source: Set project name :code:`--project=MySuperBot`
uk_ua: Встановлення назви проекту :code:`--project=MySuperBot`

source: Set version :code:`--version=2.2`
uk_ua: Встановлення версії :code:`--version=2.2`

source: Step 2: Init language
uk_ua: Крок 2: Ініціалізація перекладу

source: :code:`-i locales/messages.pot` - pre-generated template
uk_ua: :code:`-i locales/messages.pot` - попередньо створений шаблон

source: :code:`-d locales` - translations directory
uk_ua: :code:`-d locales`- тека перекладів

source: :code:`-D messages` - translations domain
uk_ua: :code:`-D messages` - домен перекладів

source: :code:`-l en` - language. Can be changed to any other valid language code (For example :code:`-l uk` for ukrainian language)
uk_ua: :code:`-l en` - мова. Може бути змінений на будь-який інший дійсний код мови (Наприклад :code:`-l uk` для української мови)

source: Step 3: Translate texts
uk_ua: Крок 3: Переклад текстів

source: To open .po file you can use basic text editor or any PO editor, e.g. `Poedit <https://poedit.net/>`_
uk_ua: Щоб відкрити файл .po, ви можете використовувати базовий текстовий редактор або будь-який редактор .po файлів, напр. `Poedit <https://poedit.net/>`_

source: Just open the file named :code:`locales/{language}/LC_MESSAGES/messages.po` and write translations
uk_ua: Просто відкрийте файл із назвою :code:`locales/{language}/LC_MESSAGES/messages.po` і впишіть переклади

source: Step 4: Compile translations
uk_ua: Крок 4: Компіляція перекладів

source: Step 5: Updating messages
uk_ua: Крок 5: Оновлення текстів

source: When you change the code of your bot you need to update po & mo files
uk_ua: Коли ви змінюєте код свого бота, вам потрібно оновити файли .po і .mo

source: Step 5.1: regenerate pot file: command from step 1
uk_ua: Крок 5.1: відновлення файлу .pot: команда з кроку 1

source: Step 5.2: update po files
uk_ua: Крок 5.2: оновлення .po файлів

source: Step 5.3: update your translations: location and tools you know from step 3
uk_ua: Крок 5.3: оновлення Ваших перекладів: розміщення та інструменти Ви знаєте з кроку 3.

source: Step 5.4: compile mo files: command from step 4
uk_ua: Крок 5.4: компіляція .mo файлів : команда з кроку 4
