Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/utils/keyboard.po
Languages: uk_ua

source: Keyboard builder
uk_ua: Конструктор клавіатури

source: Keyboard builder helps to dynamically generate markup.
uk_ua: Конструктор клавіатури допомагає динамічно генерувати розмітку

source: Note that if you have static markup, it's best to define it explicitly rather than using builder, but if you have dynamic markup configuration, feel free to use builder as you wish.
uk_ua: Зауважте, що якщо у вас є статична розмітка, найкраще визначити її явно, а не використовувати конструктор, але якщо у вас є конфігурація динамічної розмітки, сміливо використовуйте конструктор на свій розсуд.

source: Usage example
uk_ua: Приклад використання

source: Inline Keyboard
uk_ua: Клавіатура під повідомленням(Inline Keyboard)

source: Inline keyboard builder inherits all methods from generic builder
uk_ua: Конструктор клавіатури під повідомленням успадковує всі методи від універсального конструктора

source: Add new inline button to markup
uk_ua: Додавання нової кнопки до розмітки

source: Construct an InlineKeyboardMarkup
uk_ua: Створення InlineKeyboardMarkup

source: Add one or many buttons to markup.
uk_ua: Додавання однієї або кількох кнопок до розмітки.

source: Parameters
uk_ua: Параметри

source: Returns
uk_ua: Повертає

source: Adjust previously added buttons to specific row sizes.
uk_ua: Налаштування раніше доданих кнопок до певних розмірів рядків.

source: Get flatten set of all buttons
uk_ua: Отримання плоского списку усіх кнопок

source: Make full copy of current builder with markup
uk_ua: Робить повну копію поточного конструктора з розміткою

source: Export configured markup as list of lists of buttons
uk_ua: Експортує налаштовану розмітку як список списків кнопок

source: Add row to markup
uk_ua: Додає рядок у розмітку

source: When too much buttons is passed it will be separated to many rows
uk_ua: Коли передано занадто багато кнопок, вони будуть розділені на багато рядків

source: Reply Keyboard
uk_ua: Клавіатура відповідей

source: Reply keyboard builder inherits all methods from generic builder
uk_ua: Конструктор клавіатури відповідей успадковує всі методи від універсального конструктора

source: Add new button to markup
uk_ua: Додавання нової кнопки до розмітки

source: Construct an ReplyKeyboardMarkup
uk_ua: Створення ReplyKeyboardMarkup
