Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/utils/serialization.po
Languages: uk_ua

source: Telegram object serialization
uk_ua: Серіалізація об'єкта Telegram

source: Serialization
uk_ua: Серіалізація

source: To serialize Python object to Telegram object you can use pydantic serialization methods, for example:
uk_ua: Щоб перетворити об'єкт Python у об'єкт Telegram, ви можете використати методи серіалізації pydantic, наприклад:

source: If you want to bind serialized object to the Bot instance, you can use context:
uk_ua: Якщо ви хочете прив'язати серіалізований об'єкт до екземпляра бота, ви можете використати контекст:

source: Deserialization
uk_ua: Десеріалізація

source: In cases when you need to deserialize Telegram object to Python object, you can use this module.
uk_ua: У випадках, коли вам потрібно перетворити об'єкт Telegram у об'єкт Python, ви можете використати цей модуль.

source: To convert Telegram object to Python object excluding files you can use :func:`aiogram.utils.serialization.deserialize_telegram_object_to_python` function.
uk_ua: Для перетворення об'єкта Telegram у об'єкт Python без врахування файлів ви можете використати функцію :func:`aiogram.utils.serialization.deserialize_telegram_object_to_python`.

source: Deserialize telegram object to JSON compatible Python object excluding files.
uk_ua: Десеріалізуйте об'єкт Telegram у об'єкт Python, сумісний із JSON, без врахування файлів.

source: Parameters
uk_ua: Параметри

source: The telegram object to be deserialized.
uk_ua: Об'єкт Telegram для десеріалізації.

source: Default bot properties should be passed only if you want to use custom defaults.
uk_ua: Властивості бота за замовчуванням потрібно передавати лише якщо ви хочете використати власні значення за замовчуванням.

source: Whether to include the API method name in the result.
uk_ua: Чи включати назву методу API в результат.

source: Returns
uk_ua: Повертає

source: The deserialized telegram object.
uk_ua: Десеріалізований об'єкт Telegram.

source: To convert Telegram object to Python object including files you can use :func:`aiogram.utils.serialization.deserialize_telegram_object` function, which returns :class:`aiogram.utils.serialization.DeserializedTelegramObject` object.
uk_ua: Для перетворення об'єкта Telegram у об'єкт Python, враховуючи файли, ви можете використати функцію :func:`aiogram.utils.serialization.deserialize_telegram_object`, яка повертає об'єкт :class:`aiogram.utils.serialization.DeserializedTelegramObject`.

source: Deserialize Telegram Object to JSON compatible Python object.
uk_ua: Десеріалізуйте об'єкт Telegram у об'єкт Python, сумісний із JSON.

source: The object to be deserialized.
uk_ua: Об'єкт для десеріалізації.

source: The deserialized Telegram object.
uk_ua: Десеріалізований об'єкт Telegram.

source: Represents a dumped Telegram object.
uk_ua: Представляє вивантажений об'єкт Telegram.

source: The dumped data of the Telegram object.
uk_ua: Вивантажені дані об'єкта Telegram.

source: The dictionary containing the file names as keys and the corresponding `InputFile` objects as values.
uk_ua: Словник, що містить імена файлів як ключі та відповідні об'єкти `InputFile` як значення.
