Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/utils/web_app.po
Languages: uk

source: WebApp
uk: Веб Застосунок (WebApp)

source: Telegram Bot API 6.0 announces a revolution in the development of chatbots using WebApp feature.
uk: Telegram Bot API 6.0 зробив революцію у розробці чат-ботів, використовуючи особливості Веб Застосунків.

source: You can read more details on it in the official `blog <https://telegram.org/blog/notifications-bots#bot-revolution>`_ and `documentation <https://core.telegram.org/bots/webapps>`_.
uk: Ви можете прочитати більше про це в офіційному `блозі <https://telegram.org/blog/notifications-bots#bot-revolution>`_ та `документації <https://core.telegram.org/bots/webapps>`_.

source: `aiogram` implements simple utils to remove headache with the data validation from Telegram WebApp on the backend side.
uk: `aiogram` реалізує прості утиліти для усунення головного болю, надаючи готові інструменти перевірки даних із Веб Застосунку Telegram на серверній стороні.

source: Usage
uk: Використання

source: For example from frontend you will pass :code:`application/x-www-form-urlencoded` POST request with :code:`_auth` field in body and wants to return User info inside response as :code:`application/json`
uk: Наприклад, із фронтенду ви передасте :code:`application/x-www-form-urlencoded` в POST запиті із полем :code:`_auth` у тілі та хочете повернути інформацію про користувача у відповідь як :code:`application/json`

source: Functions
uk: Функції

source: Check incoming WebApp init data signature
uk: Перевірка вхідного підпису даних ініціалізації Веб Застосунку

source: Source: https://core.telegram.org/bots/webapps#validating-data-received-via-the-web-app
uk: Джерело: https://core.telegram.org/bots/webapps#validating-data-received-via-the-web-app

source: Parameters
uk: Параметри

source: bot Token
uk: Токен бота

source: data from frontend to be validated
uk: дані з фронтенду, що підлягають перевірці

source: Returns
uk: Повертає

source: Parse WebApp init data and return it as WebAppInitData object
uk: Аналіз данихі ініціалізації Веб Застосунку і повернення їх як об’єкту WebAppInitData

source: This method doesn't make any security check, so you shall not trust to this data, use :code:`safe_parse_webapp_init_data` instead.
uk: Цей метод не забезпечує безпеку, тому вам не варто довіряти цим даним, замість цього використовуйте :code:`safe_parse_webapp_init_data`.

source: data from frontend to be parsed
uk: дані з frontend для аналізу

source: Validate raw WebApp init data and return it as WebAppInitData object
uk: Перевірка необроблених даних ініціалізації Веб Застосунку і повернення їх як об’єкту WebAppInitData

source: Raise :obj:`ValueError` when data is invalid
uk: Видає :obj:`ValueError`, коли дані недійсні

source: bot token
uk: токен бота

source: data from frontend to be parsed and validated
uk: дані з фронтенду для аналізу і перевірки

source: Types
uk: Типи

source: This object contains data that is transferred to the Web App when it is opened. It is empty if the Web App was launched from a keyboard button.
uk: Об’єкт, що містить дані які передаються у Веб Застосунок під час його відкриття. Він порожній, якщо Веб Застосунок було запущено за допомогою кнопки клавіатури.

source: Source: https://core.telegram.org/bots/webapps#webappinitdata
uk: Джерело: https://core.telegram.org/bots/webapps#webappinitdata

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
uk: Конфігурація для моделі має бути словником, що відповідає [`ConfigDict`][pydantic.config.ConfigDict].

source: Metadata about the fields defined on the model, mapping of field names to [`FieldInfo`][pydantic.fields.FieldInfo].
uk: Метадані про поля, визначені на моделі, відображення назв полів у [`FieldInfo`][pydantic.fields.FieldInfo].

source: This replaces `Model.__fields__` from Pydantic V1.
uk: Це замінює `Model.__fields__` з Pydantic V1.

source: A unique identifier for the Web App session, required for sending messages via the answerWebAppQuery method.
uk: Унікальний ідентифікатор сеансу Веб Застосунку, необхідний для надсилання повідомлень через метод answerWebAppQuery.

source: An object containing data about the current user.
uk: Об'єкт, що містить дані про поточного користувача.

source: An object containing data about the chat partner of the current user in the chat where the bot was launched via the attachment menu. Returned only for Web Apps launched via the attachment menu.
uk: Об'єкт, що містить дані про співрозмовника поточного користувача в чаті, де бот був запущений через меню вкладення. Повертається тільки для веб-додатків, запущених через меню вкладень.

source: An object containing data about the chat where the bot was launched via the attachment menu. Returned for supergroups, channels, and group chats – only for Web Apps launched via the attachment menu.
uk: Об'єкт, що містить дані про чат, в якому бот був запущений через меню вкладень. Повертається для супергруп, каналів і групових чатів - тільки для веб-додатків, запущених через меню вкладень.

source: Type of the chat from which the Web App was opened. Can be either “sender” for a private chat with the user opening the link, “private”, “group”, “supergroup”, or “channel”. Returned only for Web Apps launched from direct links.
uk: Тип чату, з якого було відкрито веб-додаток. Може бути як "sender" для приватного чату з користувачем, який відкрив посилання, так і "private", "group", "supergroup" або "channel". Повертається тільки для веб-програм, запущених за прямим посиланням.

source: Global identifier, uniquely corresponding to the chat from which the Web App was opened. Returned only for Web Apps launched from a direct link.
uk: Глобальний ідентифікатор, що унікальний для чату, з якого було відкрито веб-програму. Повертається тільки для веб-додатків, запущених за прямим посиланням.

source: The value of the startattach parameter, passed via link. Only returned for Web Apps when launched from the attachment menu via link. The value of the start_param parameter will also be passed in the GET-parameter tgWebAppStartParam, so the Web App can load the correct interface right away.
uk: Значення параметра startattach, передане через посилання. Повертається лише для Веб Застосунків, коли їх запускають із меню вкладень за посиланням. Значення параметра start_param також буде передано в GET-параметр tgWebAppStartParam, тому Веб Застосунок може відразу завантажити правильний інтерфейс.

source: Time in seconds, after which a message can be sent via the answerWebAppQuery method.
uk: Час в секундах після якого повідомлення може бути відправлене за допомогою метода answerWebAppQuery.

source: Unix time when the form was opened.
uk: Unix час відкриття форми.

source: A hash of all passed parameters, which the bot server can use to check their validity.
uk: Хеш усіх переданих параметрів, за допомогою якого бот-сервер може перевірити їх дійсність.

source: This object contains the data of the Web App user.
uk: Об'єкт що містить дані користувача Веб Застосунку.

source: Source: https://core.telegram.org/bots/webapps#webappuser
uk: Джерело: https://core.telegram.org/bots/webapps#webappuser

source: A unique identifier for the user or bot. This number may have more than 32 significant bits and some programming languages may have difficulty/silent defects in interpreting it. It has at most 52 significant bits, so a 64-bit integer or a double-precision float type is safe for storing this identifier.
uk: Унікальний ідентифікатор користувача або бота. Це число може мати більше 32 значущих бітів, і деякі мови програмування можуть мати труднощі в його інтерпретації. Він має щонайбільше 52 значущі біти, тому 64-бітне ціле число або тип з плаваючою точністю подвійної точності є безпечним для зберігання цього ідентифікатора.

source: True, if this user is a bot. Returns in the receiver field only.
uk: True, якщо цей користувач бот. Повертаєтся лише в полі отримувача(receiver).

source: First name of the user or bot.
uk: Ім'я користувача або бота.

source: Last name of the user or bot.
uk: Прізвище користувача або бота.

source: Username of the user or bot.
uk: Нік користувача або бота.

source: IETF language tag of the user's language. Returns in user field only.
uk: Мовний тег IETF мови користувача. Повертаєтся лише в полі користувача(user).

source: True, if this user is a Telegram Premium user.
uk: True, якщо цей користувач має підписку Telegram Premium.

source: True, if this user added the bot to the attachment menu.
uk: True, якщо цей користувач додав бота до меню вкладень.

source: True, if this user allowed the bot to message them.
uk: True, якщо цей користувач дозволив надсилати йому повідомлення.

source: URL of the user’s profile photo. The photo can be in .jpeg or .svg formats. Only returned for Web Apps launched from the attachment menu.
uk: URL-адреса фотографії профілю користувача. Фотографія може бути у форматах .jpeg або .svg. Повертається лише для Веб Застосунків, запущених із меню вкладень.

source: This object represents a chat.
uk: Об'єкт чату.

source: Source: https://core.telegram.org/bots/webapps#webappchat
uk: Джерело: https://core.telegram.org/bots/webapps#webappchat

source: Unique identifier for this chat. This number may have more than 32 significant bits and some programming languages may have difficulty/silent defects in interpreting it. But it has at most 52 significant bits, so a signed 64-bit integer or double-precision float type are safe for storing this identifier.
uk: Унікальний ідентифікатор цього чату. Це число може мати більше 32 значущих бітів, і деякі мови програмування можуть мати труднощі в його інтерпретації. Він має щонайбільше 52 значущі біти, тому 64-бітне ціле число або тип з плаваючою точкою подвійної точності є безпечним для зберігання цього ідентифікатора.

source: Type of chat, can be either “group”, “supergroup” or “channel”
uk: Тип чату, може бути "group", "supergroup" або "channel"

source: Title of the chat
uk: Назва чату

source: Username of the chat
uk: Нік користувача або бота

source: URL of the chat’s photo. The photo can be in .jpeg or .svg formats. Only returned for Web Apps launched from the attachment menu.
uk: URL-адреса фотографії чату. Фотографія може бути у форматах .jpeg або .svg. Повертається лише для Веб Застосунків, запущених із меню вкладень.
