Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: ru, uk_ua

source: Contributing
ru: Помощь в разработке
uk_ua: Сприяння розробці

source: You're welcome to contribute to aiogram!
ru: Будем рады вашему вкладу в aiogram!
uk_ua: Ласкаво просимо зробити свій внесок у aiogram!

source: *aiogram* is an open-source project, and anyone can contribute to it in any possible way
ru: *aiogram* - проект с открытым исходным кодом и каждый может внести свой вклад
uk_ua: *aiogram* є проєктом з відкритим вихідним кодом, і будь-хто може зробити свій внесок у будь-який можливий спосіб

source: Developing
ru: Разработка
uk_ua: Розробка

source: Before making any changes in the framework code, it is necessary to fork the project and clone the project to your PC and know how to do a pull-request.
ru: Перед какими-либо изменениями в коде фреймворка необходимо сделать fork проекта, клонировать его на свой ПК и знать, как делать pull-request.
uk_ua: Перш ніж вносити будь-які зміни в код фреймворка, потрібно створити форк проєкту, клонувати проєкт на свій комп’ютер і розуміти, як робити запит на витяг (pull-request).

source: How to work with pull-request you can read in the `GitHub docs <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/creating-a-pull-request>`_
ru: Вы можете прочитать о том, как сделать pull-request в `Документации GitHub <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/creating-a-pull-request>`_
uk_ua: Як працювати із запитами на витяг (pull-request), можна прочитати в `документації GitHub <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/creating-a-pull-request>`_

source: Also in due to this project is written in Python, you will need Python to be installed (is recommended to use latest Python versions, but any version starting from 3.8 can be used)
ru: Также, так как проект написан на Python, вам будет нужен установленный Python (рекомендуется использовать последнюю версию, но подходит любая версия, стартуя от 3.8)
uk_ua: Оскільки цей проєкт написаний на Python, вам потрібно встановити Python (рекомендується використовувати останні версії Python, але можна використовувати будь-яку версію, починаючи з 3.8)

source: Use virtualenv
ru: Использование виртуального окружения
uk_ua: Використовуйте virtualenv

source: You can create a virtual environment in a directory using :code:`venv` module (it should be pre-installed by default):
ru: Вы можете создать виртуальное окружение в директории, используя команду :code:`python -m venv .venv`:
uk_ua: Ви можете створити віртуальне середовище в каталозі, використовуючи модуль :code:`venv` (він повинен бути попередньо встановлений за замовчуванням):

source: This action will create a :code:`.venv` directory with the Python binaries and then you will be able to install packages into that isolated environment.
ru: Это действие приведёт к созданию директории :code:`.venv` с бинарными файлами Python, после чего вы сможете устанавливать пакеты в этом изолированном окружении.
uk_ua: Ця дія створить каталог :code:`.venv` з виконуваними файлами Python, і тоді ви зможете встановлювати пакунки в цьому ізольованому середовищі.

source: Activate the environment
ru: Активация окружения
uk_ua: Активуйте середовище

source: Windows cmd
ru: Командная строка Windows

source: To check it worked, use described command, it should show the :code:`pip` version and location inside the isolated environment
ru: Для проверки окружения используйте данную команду. Она выводит версию :code:`pip`
uk_ua: Щоб перевірити, що все працює, скористайтеся описаною командою, яка повинна показати версію :code:`pip` і його розташування в ізольованому середовищі

source: Also make sure you have the latest pip version in your virtual environment to avoid errors on next steps:
ru: Также убедитесь, что вы используете последнюю версию pip в вашем виртуальном окружении для избежания ошибок на следующих шагах:
uk_ua: Також переконайтеся, що у вас найновіша версія pip у вашому віртуальному середовищі, щоб уникнути помилок на наступних етапах:

source: Setup project
ru: Настройка проекта
uk_ua: Налаштування проєкту

source: After activating the environment install `aiogram` from sources and their dependencies.
ru: После активации окружения установите `aiogram` и зависимости
uk_ua: Після активації середовища встановіть `aiogram` із вихідних кодів разом із їх залежностями.

source: It will install :code:`aiogram` in editable mode into your virtual environment and all dependencies.
ru: Это установит :code:`aiogram` и зависимости в вашем виртуальном окружении
uk_ua: Це встановить :code:`aiogram` у режимі редагування у ваше віртуальне середовище та всі залежності.

source: Making changes in code
ru: Изменения в коде
uk_ua: Внесення змін у код

source: At this point you can make any changes in the code that you want, it can be any fixes, implementing new features or experimenting.
ru: Вы можете делать любые изменения в коде, включая багфиксы, рефакторинг, внедрение новых функций или экспериментирование
uk_ua: На цьому етапі ви можете вносити будь-які зміни у код, які бажаєте, це можуть бути виправлення, впровадження нових функцій або експерименти.

source: Format the code (code-style)
ru: Форматирование кода (стиль кода)
uk_ua: Форматування коду (стиль коду)

source: Note that this project is Black-formatted, so you should follow that code-style, too be sure You're correctly doing this let's reformat the code automatically:
ru: Проект форматирован по стандарту Black. Убедитесь, что вы следуете данному стилю кода. Чтобы правильно это сделать, реформатируйте код автоматически:
uk_ua: Зверніть увагу, що цей проєкт використовує форматування Black, тому ви також маєте дотримуватись цього стилю коду. Щоб упевнитись, що ви робите це правильно, відформатуйте код автоматично:

source: Run tests
ru: Запуск тестов
uk_ua: Запуск тестів

source: All changes should be tested:
ru: Все изменения должны быть протестированы:
uk_ua: Всі зміни повинні бути протестовані:

source: Also if you are doing something with Redis-storage or/and MongoDB-storage, you will need to test everything works with Redis or/and MongoDB:
ru: Также, если вы изменяете что-то, связанное с хранилищем Redis и/или MongoDB, вам нужно будет протестировать всё, что связано с Redis и/или MongoDB
uk_ua: Крім того, якщо ви працюєте з Redis-сховищем і/або сховищем MongoDB, вам потрібно протестувати, чи все працює з Redis і/або MongoDB:

source: Docs
ru: Документация
uk_ua: Документація

source: We are using `Sphinx` to render docs in different languages, all sources located in `docs` directory, you can change the sources and to test it you can start live-preview server and look what you are doing:
ru: Мы используем `Sphinx` для отображения документации на других языках, все файлы хранятся в директории `docs`. Вы можете изменять исходный код и, чтобы
uk_ua: Ми використовуємо `Sphinx` для створення документації різними мовами. Всі вихідні файли знаходяться в каталозі `docs`. Ви можете змінювати джерела та тестувати їх, запустивши сервер попереднього перегляду, щоб побачити, що ви робите:

source: Docs translations
ru: Переводы документации
uk_ua: Переклади документації

source: Translation of the documentation is very necessary and cannot be done without the help of the community from all over the world, so you are welcome to translate the documentation into different languages.
ru: Переводы документации очень важны и не могут быть сделаны без поддержки людей со всего мира, поэтому мы были бы очень рады вашим переводам документации на другие языки
uk_ua: Переклад документації є дуже важливим і не може бути виконаний без допомоги спільноти зі всього світу, тому ми запрошуємо вас перекладати документацію різними мовами.

source: Before start, let's up to date all texts:
ru: Перед началом скопируйте все тексты:
uk_ua: Перш ніж почати, оновіть усі тексти:

source: Change the :code:`<language_code>` in example below to the target language code, after that you can modify texts inside :code:`docs/locale/<language_code>/LC_MESSAGES` as :code:`*.po` files by using any text-editor or specialized utilites for GNU Gettext, for example via `poedit <https://poedit.net/>`_.
ru: Измените :code:`<language_code>` в примере на требуемый язык, после чего вы сможете модифицировать текст внутри :code:`docs/locale/<language_code>/ LC_MESSAGES` как :code:`*.po` файлы через любой текстовый редактор или специализированное ПО для GNU Gettext, например, `poedit <https://poedit.net/>`_.
uk_ua: Змініть :code:`<language_code>` у прикладі нижче на код цільової мови, після цього ви можете змінювати тексти в :code:`docs/locale/<language_code>/LC_MESSAGES` як файли :code:`*.po`, використовуючи будь-який текстовий редактор або спеціалізовані утиліти для GNU Gettext, наприклад за допомогою `poedit <https://poedit.net/>`_.

source: To view results:
ru: Для просмотра результатов:
uk_ua: Щоб переглянути результати:

source: Describe changes
ru: Описание изменений
uk_ua: Опишіть зміни

source: Describe your changes in one or more sentences so that bot developers know what's changed in their favorite framework - create `<code>.<category>.rst` file and write the description.
ru: Опишите свои изменения в нескольких предложениях, чтобы разработчики ботов знали, что изменилось в их любимом фреймворке - создайте файл `<code>.<category>.rst` и напишите описание.
uk_ua: Опишіть свої зміни одним або кількома реченнями, щоб розробники ботів знали, що змінилося у їхньому улюбленому фреймворку. Створіть файл `<code>.<category>.rst` і напишіть опис.

source: :code:`<code>` is Issue or Pull-request number, after release link to this issue will be published to the *Changelog* page.
ru: :code:`<code>` - номер Issue или Pull-request, после релиза ссылка на этот issue будет опубликована в *Changelog*.
uk_ua: :code:`<code>` — це номер issue або запиту на витяг (pull-request). Після релізу посилання на цей issue буде опубліковано на сторінці *Changelog*.

source: :code:`<category>` is a changes category marker, it can be one of:
ru: :code:`<category>` - маркер категории изменений, один из:
uk_ua: :code:`<category>` — це маркер категорії змін, і це може бути одне з наступного:

source: :code:`feature` - when you are implementing new feature
ru: :code:`feature` - если вы внедрили новый функционал
uk_ua: :code:`feature` — якщо ви впроваджуєте нову функцію

source: :code:`bugfix` - when you fix a bug
ru: :code:`bugfix` - если вы пофиксили баг
uk_ua: :code:`bugfix` — якщо ви виправляєте помилку

source: :code:`doc` - when you improve the docs
ru: :code:`doc` - если вы улучшили документацию
uk_ua: :code:`doc` — якщо ви покращуєте документацію

source: :code:`removal` - when you remove something from the framework
ru: :code:`removal` - если вы удалили что-либо из фреймворка
uk_ua: :code:`removal` — якщо ви видаляєте щось із фреймворку

source: :code:`misc` - when changed something inside the Core or project configuration
ru: :code:`misc` - если вы изменили что-либо в основе или конфигурации проекта
uk_ua: :code:`misc` — якщо ви змінили щось усередині ядра або конфігурації проєкту

source: If you have troubles with changing category feel free to ask Core-contributors to help with choosing it.
ru: Если у вас возникли проблемы с выбором категории, не стесняйтесь спрашивать главных разработчиков для помощи с выбором
uk_ua: Якщо у вас виникли труднощі з вибором категорії, не соромтеся звертатися до основних контриб'юторів за допомогою.

source: Complete
ru: Финальные действия
uk_ua: Завершення

source: After you have made all your changes, publish them to the repository and create a pull request as mentioned at the beginning of the article and wait for a review of these changes.
ru: После того, как вы сделали изменения, опубликуйте их в свой репозиторий и создайте pull request с упоминанем основных разработчиков и ждите рассмотрения этих изменений
uk_ua: Після того, як ви внесли всі зміни, опублікуйте їх у репозиторії і створіть запит на витяг, як зазначено в початку статті, і зачекайте на перегляд цих змін.

source: Star on GitHub
ru: Stars на GitHub
uk_ua: Зірка на GitHub

source: You can "star" repository on GitHub - https://github.com/aiogram/aiogram (click the star button at the top right)
ru: Вы можете поставить "звезду" репозиторию на GitHub - https://github.com/aiogram/aiogram (нажмите на кнопку звезды сверху справа)
uk_ua: Ви можете «зіркувати» репозиторій на GitHub -https://github.com/aiogram/aiogram (натисніть кнопку зірки в правому верхньому куті)

source: Adding stars makes it easier for other people to find this project and understand how useful it is.
ru: Звёзды помогают другим людям находить этот проект и понимать его ценность
uk_ua: Додавання зірок полегшує іншим людям знаходження цього проекту і розуміння того, наскільки він корисний.

source: Guides
ru: Инструкции
uk_ua: Інструкції

source: You can write guides how to develop Bots on top of aiogram and publish it into YouTube, Medium, GitHub Books, any Courses platform or any other platform that you know.
ru: Вы можете записывать инструкции по разработке ботов на aiogram и публиковать их на YouTube, Medium, GitHub Books, любые платформы с курсами и на другие платформы
uk_ua: Ви можете написати посібники, як розробляти ботів на основі aiogram і публікувати їх на YouTube, Medium, GitHub Books, будь-якій платформі курсів або на будь-якій іншій платформі, яку ви знаєте.

source: This will help more people learn about the framework and learn how to use it
ru: Это поможет большему количеству людей узнать об фреймворке и как его использовать
uk_ua: Це допоможе більшій кількості людей дізнатися про фреймворк і навчитися його використовувати.

source: Take answers
ru: Отвечайте на вопросы
uk_ua: Запитання

source: The developers is always asks for any question in our chats or any other platforms like GitHub Discussions, StackOverflow and others, feel free to answer to this questions.
ru: Разработчики постоянно задают вопросы в наших чатах и других различных платформах, таких как GitHub Discussions, StackOverflow и других, не стесняйтесь отвечать на них
uk_ua: Розробники завжди задають питання в наших чатах або на інших платформах, таких як GitHub Discussions, StackOverflow та інших, не соромтеся відповідати на ці питання.

source: Funding
ru: Поддержка
uk_ua: Фінансова підтримка

source: The development of the project is free and not financed by commercial organizations, it is my personal initiative (`@JRootJunior <https://t.me/JRootJunior>`_) and I am engaged in the development of the project in my free time.
ru: Разработка проекта бесплатна и не финансируется коммерческими организациями, это моя личная инициатива (`@JRootJunior <https://t.me/JRootJunior>`_) и я занимаюсь разработкой в свободное время
uk_ua: Розробка проекту є безкоштовною і не фінансується комерційними організаціями, це моя особиста ініціатива (`@JRootJunior <https://t.me/JRootJunior>`_) і я займаюся розробкою проекту у вільний час.

source: So, if you want to financially support the project, or, for example, give me a pizza or a beer, you can do it on `OpenCollective <https://opencollective.com/aiogram>`_.
ru: Так что если хотите финансово поддержать проект или, например, дать мне пиццу или пиво, вы можете сделать это на платформе `OpenCollective <https://opencollective.com/aiogram>`_.
uk_ua: Тож, якщо ви хочете фінансово підтримати проект, або, наприклад, купити мені піцу чи пиво, ви можете зробити це на `OpenCollective <https://opencollective.com/aiogram>`_.
