Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/migration_2_to_3.po
Languages: uk_ua

source: Migration FAQ (2.x -> 3.0)
uk_ua: FAQ по переходу з версії 2.x на 3.0

source: This guide is still in progress.
uk_ua: Цей посібник все ще в розробці.

source: This version introduces numerous breaking changes and architectural improvements. It helps reduce the count of global variables in your code, provides useful mechanisms to modularize your code, and enables the creation of shareable modules via packages on PyPI. It also makes middlewares and filters more controllable, among other improvements.
uk_ua: Ця версія містить численні суттєві зміни та архітектурні покращення. Вона допомагає зменшити кількість глобальних змінних у вашому коді, надає корисні механізми для модуляризації вашого коду та дозволяє створювати спільні модулі за допомогою пакетів на PyPI. Крім того, серед інших покращень, він робить проміжне програмне забезпечення (мідлварі) та фільтри більш контрольованими.

source: On this page, you can read about the changes made in relation to the last stable 2.x version.
uk_ua: На цій сторінці ви можете прочитати про зміни, внесені в останню стабільну версію 2.x.

source: This page more closely resembles a detailed changelog than a migration guide, but it will be updated in the future.
uk_ua: Ця сторінка більше нагадує детальний список змін, ніж посібник з міграції, але вона буде оновлюватися в майбутньому.

source: Feel free to contribute to this page, if you find something that is not mentioned here.
uk_ua: Не соромтеся зробити свій внесок у цю сторінку, якщо ви знайшли щось, про що тут не згадано.

source: Dependencies
uk_ua: Залежності

source: The dependencies required for :code:`i18n` are no longer part of the default package. If your application uses translation functionality, be sure to add an optional dependency:
uk_ua: Залежності, необхідні для :code:`i18n`, більше не є частиною пакету за замовчуванням. Якщо ваш додаток використовує функціональність перекладу, обов'язково додайте необов'язкову залежність:

source: Dispatcher
uk_ua: Диспетчер

source: The |Dispatcher| class no longer accepts a |Bot| instance in its initializer. Instead, the |Bot| instance should be passed to the dispatcher only for starting polling or handling events from webhooks. This approach also allows for the use of multiple bot instances simultaneously ("multibot").
uk_ua: Клас :class:`Dispatcher` більше не приймає екземпляр `Bot` у своєму ініціалізаторі. Замість цього екземпляр `Bot` слід передавати диспетчеру тільки для запуску полінгу або обробки подій з вебхуків. Такий підхід також дозволяє використовувати декілька екземплярів бота одночасно ("мультибот").

source: |Dispatcher| now can be extended with another Dispatcher-like thing named |Router|. With routes, you can easily modularize your code and potentially share these modules between projects. (:ref:`Read more » <Nested routers>`.)
uk_ua: Клас :class:`Dispatcher` тепер можна розширити ще одним об'єктом на кшталт диспетчера з назвою :class:`Router` (:ref:`Детальніше » <Nested routers>`).

source: Removed the **_handler** suffix from all event handler decorators and registering methods. (:ref:`Read more » <Event observers>`)
uk_ua: Видалено суфікс **_handler** з усіх декораторів обробників подій та методів реєстрації. (:ref:`Детальніше » <Event observers>`)

source: The :class:`Executor` has been entirely removed; you can now use the |Dispatcher| directly to start poll the API or handle webhooks from it.
uk_ua: Executor було повністю вилучено; тепер ви можете використовувати Dispatcher безпосередньо для запуску полінгу або обробки вебхуків.

source: The throttling method has been completely removed; you can now use middlewares to control the execution context and implement any throttling mechanism you desire.
uk_ua: Метод дроселювання (Throttling) повністю вилучено; тепер ви можете використовувати проміжне програмне забезпечення (middleware) для керування контекстом виконання та реалізовувати будь-який механізм дроселювання за вашим бажанням.

source: Removed global context variables from the API types, |Bot| and |Dispatcher| object. From now on, if you want to access the current bot instance within handlers or filters, you should accept the argument :code:`bot: Bot` and use it instead of :code:`Bot.get_current()`. In middlewares, it can be accessed via :code:`data["bot"]`.
uk_ua: Вилучено глобальні контекстні змінні з типів API, об'єктів Bot та Dispatcher, Відтепер, якщо ви хочете отримати доступ до поточного екземпляру бота в обробниках або фільтрах, ви повинні приймати аргумент :code:`bot: Bot` і використовувати його замість :code:`Bot.get_current()`. У проміжному програмному забезпеченні (middleware) доступ до нього можна отримати через :code:`data["bot"]`.

source: Filtering events
uk_ua: Фільтрація подій

source: Keyword filters can no longer be used; use filters explicitly. (`Read more » <https://github.com/aiogram/aiogram/issues/942>`_)
uk_ua: Фільтри за ключовими словами більше не можна використовувати; використовуйте фільтри явно. (`Детальніше » <https://github.com/aiogram/aiogram/issues/942>`_)

source: Due to the removal of keyword filters, all previously enabled-by-default filters (such as state and content_type) are now disabled. You must specify them explicitly if you wish to use them. For example instead of using :code:`@dp.message_handler(content_types=ContentType.PHOTO)` you should use :code:`@router.message(F.photo)`
uk_ua: У зв'язку з вилученням keyword фільтрів, всі раніше ввімкнені за замовчуванням фільтри (такі як state і content_type) тепер вимкнено. Якщо ви бажаєте їх використовувати, ви повинні вказати їх явно. Наприклад, замість :code:`@dp.message_handler(content_types=ContentType.PHOTO)` слід використовувати :code:`@router.message(F.photo)`.

source: By default, the message handler now receives any content type. If you want a specific one, simply add the appropriate filters (Magic or any other).
uk_ua: За замовчуванням обробник повідомлень тепер отримує будь-який тип вмісту. Якщо вам потрібен певний тип, просто додайте відповідні фільтри (Magic або будь-який інший).

source: The state filter is no longer enabled by default. This means that if you used :code:`state="*"` in v2, you should not pass any state filter in v3. Conversely, if the state was not specified in v2, you will now need to specify it in v3.
uk_ua: Фільтр стану більше не вмикається за замовчуванням. Це означає, що якщо ви використовували :code:`state="*"` у v2, вам не слід передавати фільтр стану у v3. І навпаки, якщо стан не було вказано у v2, вам потрібно буде вказати його у v3.

source: Added the possibility to register global filters for each router, which helps to reduce code repetition and provides an easier way to control the purpose of each router.
uk_ua: Додано можливість реєстрації глобальних фільтрів для кожного роутера, що допомагає зменшити повторення коду і полегшує контроль призначення кожного роутера.

source: All API methods are now classes with validation, implemented via `pydantic <https://docs.pydantic.dev/>`_. These API calls are also available as methods in the Bot class.
uk_ua: Всі методи API тепер є класами з валідацією, реалізованими через `pydantic <https://docs.pydantic.dev/>`_. Ці виклики API також доступні як методи в класі Bot.

source: More pre-defined Enums have been added and moved to the `aiogram.enums` sub-package. For example, the chat type enum is now :class:`aiogram.enums.ChatType` instead of :class:`aiogram.types.chat.ChatType`.
uk_ua: Додано більше попередньо визначених enums та переміщено їх до підпакету `aiogram.enums`. Наприклад, enum типу чату тепер має вигляд :class:`aiogram.enums.ChatType` замість :class:`aiogram.types.chat.ChatType`.

source: The HTTP client session has been separated into a container that can be reused across different Bot instances within the application.
uk_ua: Клієнтська сесія HTTP була відокремлена в контейнер, який можна повторно використовувати для різних екземплярів бота в додатку.

source: API Exceptions are no longer classified by specific messages, as Telegram has no documented error codes. However, all errors are classified by HTTP status codes, and for each method, only one type of error can be associated with a given code. Therefore, in most cases, you should check only the error type (by status code) without inspecting the error message.
uk_ua: Виключення API більше не класифікуються за конкретними повідомленнями, оскільки Telegram не має задокументованих кодів помилок. Проте всі помилки класифікуються за кодами статусу HTTP, і для кожного методу з певним кодом може бути пов'язаний лише один тип помилки. Тому в більшості випадків слід перевіряти лише тип помилки (за кодом статусу), не перевіряючи повідомлення про помилку.

source: Middlewares
uk_ua: Проміжне ПО (Middlewares)

source: Middlewares can now control an execution context, e.g., using context managers. (:ref:`Read more » <middlewares>`)
uk_ua: Проміжне програмне забезпечення тепер може керувати контекстом виконання, наприклад, за допомогою менеджерів контексту. (:ref:`Детальніше » <middlewares>`)

source: All contextual data is now shared end-to-end between middlewares, filters, and handlers. For example now you can easily pass some data into context inside middleware and get it in the filters layer as the same way as in the handlers via keyword arguments.
uk_ua: Всі контекстні дані тепер наскрізно використовуються між проміжним програмним забезпеченням, фільтрами та обробниками. Наприклад, тепер ви можете легко передати деякі дані в контекст у проміжному програмному забезпеченні і отримати їх у шарі фільтрів так само, як і в обробниках через аргументи ключових слів.

source: Added a mechanism named **flags** that helps customize handler behavior in conjunction with middlewares. (:ref:`Read more » <flags>`)
uk_ua: Додано механізм з назвою **flags**, який допомагає налаштовувати поведінку обробника у поєднанні з проміжним програмним забезпеченням. (:ref:`Детальніше про » <flags>`)

source: Keyboard Markup
uk_ua: Розмітка клавіатури

source: Now :class:`aiogram.types.inline_keyboard_markup.InlineKeyboardMarkup` and :class:`aiogram.types.reply_keyboard_markup.ReplyKeyboardMarkup` no longer have methods for extension, instead you have to use markup builders :class:`aiogram.utils.keyboard.ReplyKeyboardBuilder` and :class:`aiogram.utils.keyboard.KeyboardBuilder` respectively (:ref:`Read more » <Keyboard builder>`)
uk_ua: Тепер :class:`aiogram.types.inline_keyboard_markup.InlineKeyboardMarkup` та :class:`aiogram.types.reply_keyboard_markup.ReplyKeyboardMarkup` більше не мають методів для розширення, натомість вам слід використовувати будівники розмітки :class:`aiogram.utils.keyboard.ReplyKeyboardBuilder` та :class:`aiogram.utils.keyboard.InlineKeyboardBuilder` відповідно (:ref:`Детальніше » <Keyboard builder>`)

source: Callbacks data
uk_ua: Дані зворотного виклику

source: The callback data factory is now strictly typed using `pydantic <https://docs.pydantic.dev/>`_ models. (:ref:`Read more » <Callback data factory>`)
uk_ua: Фабрику даних зворотного виклику тепер строго типізовано за допомогою моделей `pydantic <https://docs.pydantic.dev/>`_. (:ref:`Детальніше » <Callback data factory>`)

source: Finite State machine
uk_ua: Скінченний автомат

source: State filters will no longer be automatically added to all handlers; you will need to specify the state if you want to use it.
uk_ua: Фільтри станів більше не будуть автоматично додаватися до всіх обробників; вам потрібно буде вказати стан, якщо ви хочете його використати.

source: Added the possibility to change the FSM strategy. For example, if you want to control the state for each user based on chat topics rather than the user in a chat, you can specify this in the |Dispatcher|.
uk_ua: Додано можливість змінювати стратегію FSM. Наприклад, якщо ви хочете контролювати стан для кожного користувача на основі топіків чату, а не користувача в чаті, ви можете вказати це в Диспетчері.

source: The state proxy is deprecated; you should update the state data by calling :code:`state.set_data(...)` and :code:`state.get_data()` respectively.
uk_ua: Проксі стану є застарілим; вам слід оновити дані стану, викликавши :code:`state.set_data(...)` та :code:`state.get_data()` відповідно.

source: Sending Files
uk_ua: Надсилання файлів

source: From now on, you should wrap files in an InputFile object before sending them, instead of passing the IO object directly to the API method. (:ref:`Read more » <sending-files>`)
uk_ua: Відтепер перед відправкою файлів слід обертати їх в об'єкт InputFile замість того, щоб передавати об'єкт вводу-виводу безпосередньо до методу API. (:ref:`Детальніше » <sending-files>`)

source: Webhook
uk_ua: Вебхук

source: The aiohttp web app configuration has been simplified.
uk_ua: Спрощено налаштування веб-застосунку aiohttp.

source: By default, the ability to upload files has been added when you `make requests in response to updates <https://core.telegram.org/bots/faq#how-can-i-make-requests-in-response-to-updates>`_ (available for webhook only).
uk_ua: За замовчуванням додана можливість завантаження файлів при `відповідях на оновлення <https://core.telegram.org/bots/faq#how-can-i-make-requests-in-response-to-updates>`_ (доступно тільки для вебхука).

source: Telegram API Server
uk_ua: Сервер Telegram API

source: Telegram objects transformation (to dict, to json, from json)
uk_ua: Перетворення об'єктів Telegram (у словник, у json, з json)

source: Methods :code:`TelegramObject.to_object()`, :code:`TelegramObject.to_json()` and :code:`TelegramObject.to_python()` have been removed due to the use of `pydantic <https://docs.pydantic.dev/>`_ models.
uk_ua: Методи :code:`TelegramObject.to_object()`, :code:`TelegramObject.to_json()` та :code:`TelegramObject.to_python()` були вилучені через використання моделей `pydantic <https://docs.pydantic.dev/>`_.

source: :code:`TelegramObject.to_object()` should be replaced by :code:`TelegramObject.model_validate()` (`Read more <https://docs.pydantic.dev/2.7/api/base_model/#pydantic.BaseModel.model_validate>`_)
uk_ua: :code:`TelegramObject.to_object()` слід замінити на :code:`TelegramObject.model_validate()` (`Детальніше <https://docs.pydantic.dev/2.7/api/base_model/#pydantic.BaseModel.model_validate>`_)

source: :code:`TelegramObject.as_json()` should be replaced by :func:`aiogram.utils.serialization.deserialize_telegram_object_to_python`
uk_ua: :code:`TelegramObject.as_json()` слід замінити на :func:`aiogram.utils.serialization.deserialize_telegram_object_to_python`

source: :code:`<TelegramObject>.to_python()` should be replaced by :code:`json.dumps(deserialize_telegram_object_to_python(<TelegramObject>))`
uk_ua: :code:`<TelegramObject>.to_python()` слід замінити на :code:`json.dumps(deserialize_telegram_object_to_python(<TelegramObject>))`

source: Here are some usage examples:
uk_ua: Ось деякі приклади використання:

source: Creating an object from a dictionary representation of an object
uk_ua: Створення об'єкта з представлення об'єкта у вигляді словника

source: Creating a json representation of an object
uk_ua: Cтворення представлення об'єкта у вигляді json

source: Creating a dictionary representation of an object
uk_ua: Створення представлення об'єкта у вигляді словника

source: ChatMember tools
uk_ua: Інструменти ChatMember

source: Now :class:`aiogram.types.chat_member.ChatMember` no longer contains tools to resolve an object with the appropriate status.
uk_ua: Тепер :class:`aiogram.types.chat_member.ChatMember` більше не містить інструментів для вирішення об'єкта з відповідним статусом.

source: Now :class:`aiogram.types.chat_member.ChatMember` and all its child classes no longer contain methods for checking for membership in certain logical groups. As a substitute, you can use pre-defined groups or create such groups yourself and check their entry using the :func:`isinstance` function
uk_ua: Відтепер :class:`aiogram.types.chat_member.ChatMember` та всі його дочірні класи більше не містять методів для перевірки належності до певних логічних груп. Замість цього ви можете використовувати попередньо визначені групи або створювати такі групи самостійно та перевіряти їх входження за допомогою функції :func:`isinstance`

source: You also can independently create group similar to ADMINS that fits the logic of your application.
uk_ua: Також ви можете самостійно створити групу, подібну до ADMINS, яка відповідає логіці вашого застосунку.

source: E.g., you can create a PUNISHED group and include banned and restricted members there!
uk_ua: Наприклад, ви можете створити групу PUNISHED та включити туди заблокованих та обмежених учасників!
