Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/api/defaults.po
Languages: uk_ua

source: Global defaults
uk_ua: Глобальні налаштування

source: aiogram provides mechanism to set some global defaults for all requests to Telegram Bot API in your application using :class:`aiogram.client.default.DefaultBotProperties` class.
uk_ua: aiogram надає механізм для встановлення деяких глобальних налаштувань для всіх запитів до Telegram Bot API у вашому додатку, використовуючи клас :class:`aiogram.client.default.DefaultBotProperties`.

source: There are some properties that can be set:
uk_ua: Можна встановити деякі властивості:

source: Default bot properties.
uk_ua: Стандартні властивості бота.

source: Default parse mode for messages.
uk_ua: Стандартний режим розбору для повідомлень.

source: Sends the message silently. Users will receive a notification with no sound.
uk_ua: Відправляє повідомлення без звуку. Користувачі отримають сповіщення без звукового сигналу.

source: Protects content from copying.
uk_ua: Захищає вміст від копіювання.

source: Allows to send messages without reply.
uk_ua: Дозволяє надсилати повідомлення без відповіді.

source: Link preview settings.
uk_ua: Налаштування попереднього перегляду посилань.

source: Disables link preview.
uk_ua: Вимикає попередній перегляд посилань.

source: Prefer small media in link preview.
uk_ua: Віддавати перевагу малим медіафайлам у попередньому перегляді посилань.

source: Prefer large media in link preview.
uk_ua: Віддавати перевагу великим медіафайлам у попередньому перегляді посилань.

source: Show link preview above text.
uk_ua: Показувати попередній перегляд посилання над текстом.

source: Show caption above media.
uk_ua: Показувати підпис над медіафайлом.

source: If you need to override default properties for some requests, you should use `aiogram.client.default.DefaultBotProperties` only for properties that you want to set as defaults and pass explicit values for other properties.
uk_ua: Якщо вам потрібно змінити стандартні властивості для деяких запитів, слід використовувати `aiogram.client.default.DefaultBotProperties` лише для властивостей, які ви хочете встановити за замовчуванням, і передавати явні значення для інших властивостей.

source: If you upgrading from aiogram 3.0-3.6 to 3.7, you should update your code to use `aiogram.client.default.DefaultBotProperties`.
uk_ua: Якщо ви оновлюєтеся з версії aiogram 3.0-3.6 до 3.7, вам потрібно оновити свій код для використання `aiogram.client.default.DefaultBotProperties`.

source: Example
uk_ua: Приклад

source: Here is an example of setting default parse mode for all requests to Telegram Bot API:
uk_ua: Ось приклад встановлення стандартного режиму розбору для всіх запитів до Telegram Bot API:

source: In this case all messages sent by this bot will be parsed as HTML, so you don't need to specify `parse_mode` in every message you send.
uk_ua: У цьому випадку всі повідомлення, надіслані цим ботом, будуть розбиратися як HTML, тому вам не потрібно вказувати `parse_mode` у кожному повідомленні, що ви надсилаєте.

source: Instead of
uk_ua: Замість

source: you can use
uk_ua: ви можете використовувати

source: and the message will be sent with HTML parse mode.
uk_ua: і повідомлення буде надіслано в режимі розбору HTML.

source: In some cases you may want to override default properties for some requests. You can do it by passing explicit values to the method:
uk_ua: У деяких випадках ви можете захотіти змінити стандартні властивості для деяких запитів. Ви можете зробити це, передаючи явні значення в метод:

source: In this case the message will be sent with Markdown parse mode instead of default HTML.
uk_ua: У цьому випадку повідомлення буде надіслано в режимі Markdown замість стандартного HTML.

source: Another example of overriding default properties:
uk_ua: Ще один приклад перевизначення стандартних властивостей:

source: In this case the message will be send withoout parse mode, even if default parse mode is set it may be useful if you want to send message with plain text or :ref:`aiogram.types.message_entity.MessageEntity`.
uk_ua: У цьому випадку повідомлення буде надіслано без режиму розбору, навіть якщо встановлено стандартний режим розбору. Це може бути корисним, якщо ви хочете надіслати повідомлення у вигляді звичайного тексту або :ref:`aiogram.types.message_entity.MessageEntity`.
