Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/api/download_file.po
Languages: ru, uk_ua

source: How to download file?
ru: Как загрузить файл?
uk_ua: Як завантажити файл?

source: Download file manually
ru: Загрузка файла вручную
uk_ua: Завантаження файла вручну

source: First, you must get the `file_id` of the file you want to download. Information about files sent to the bot is contained in `Message <types/message.html>`__.
ru: Сначала, вы должны получить `file_id` файла, который хотите загрузить. Информация о файлах отправленных боту хранится в `Message <types/message.html>`__.
uk_ua: По-перше, ви повинні отримати `file_id` файлу, який ви хочете завантажити. Інформація про файли, надіслані боту, міститься в `Message <types/message.html>`__.

source: For example, download the document that came to the bot.
ru: Например, загрузим документ, присланный боту.
uk_ua: Наприклад, завантажте документ, який прийшов боту.

source: Then use the `getFile <methods/get_file.html>`__ method to get `file_path`.
ru: Затем используем метод `getFile <methods/get_file.html>`__ чтобы получить `file_path`.
uk_ua: Потім скористайтеся методом `getFile <methods/get_file.html>`__, щоб отримати `file_path`.

source: After that, use the `download_file <#download-file>`__ method from the bot object.
ru: После этого, используем метод `download_file <#download-file>`__ из объекта бота.
uk_ua: Після цього скористайтеся методом `download_file <#download-file>`__ з об’єкта бота.

source: Download file by `file_path` to destination.
ru: Загрузить файл из `file_path` в пункт назначения.
uk_ua: Завантажує файл за `file_path` у вказане місце.

source: If you want to automatically create destination (:obj:`io.BytesIO`) use default value of destination and handle result of this method.
ru: Если вы хотите автоматически создать пункт назначения (:obj:`io.BytesIO`) используйте значение по умолчанию параметра destination и обработайте результат этого метода.
uk_ua: Якщо ви хочете автоматично створити місце призначення (io.BytesIO), використовуйте значення призначення за замовчуванням і обробіть результат цього методу.

source: Download file by file_path to destination.
uk_ua: Завантажує файл з file_path у вказане місце.

source: If you want to automatically create destination (:class:`io.BytesIO`) use default value of destination and handle result of this method.
uk_ua: Якщо ви хочете автоматично створити місце призначення (io.BytesIO), використовуйте значення призначення за замовчуванням і обробіть результат цього методу.

source: Parameters
uk_ua: Параметри

source: File path on Telegram server (You can get it from :obj:`aiogram.types.File`)
uk_ua: Шлях до файлу на сервері Telegram (Ви можете отримати його з :obj:`aiogram.types.File`)

source: Filename, file path or instance of :class:`io.IOBase`. For e.g. :class:`io.BytesIO`, defaults to None
uk_ua: Ім’я файлу, шлях до файлу або екземпляр :class:`io.IOBase`. Для напр. :class:`io.BytesIO`, за замовчуванням немає

source: Total timeout in seconds, defaults to 30
uk_ua: Загальний час очікування в секундах, за замовчуванням 30

source: File chunks size, defaults to 64 kb
uk_ua: Розмір фрагментів файлу, за замовчуванням 64 Кб

source: Go to start of file when downloading is finished. Used only for destination with :class:`typing.BinaryIO` type, defaults to True
uk_ua: Перейти до початку файлу, коли завантаження завершиться. Використовується лише для призначення з типом :class:`typing.BinaryIO`, за замовчуванням значення True

source: There are two options where you can download the file: to **disk** or to **binary I/O object**.
ru: Есть два варианта, куда вы можете загрузить файл: на **диск** или в **binary I/O object**.
uk_ua: Існує два варіанти завантаження файлу: на **disk** або на **binary I/O object**.

source: Download file to disk
ru: Загрузка файла на диск
uk_ua: Завантаження файлу на диск

source: To download file to disk, you must specify the file name or path where to download the file. In this case, the function will return nothing.
ru: Чтобы загрузить файл на диск, вы должны указать имя файла или путь, куда загрузить файл. В этом случае, функция ничего не вернёт.
uk_ua: Щоб завантажити файл на диск, необхідно вказати ім'я файлу або шлях, куди його завантажити. У цьому випадку функція нічого не поверне.

source: Download file to binary I/O object
ru: Загрузить файл в binary I/O object
uk_ua: Завантаження файлу в оперативну пам'ять

source: To download file to binary I/O object, you must specify an object with the :obj:`typing.BinaryIO` type or use the default (:obj:`None`) value.
ru: Чтобы загрузить файл в binary I/O object, вы должны указать объект с помощью типа :obj:`typing.BinaryIO` или использовать значение по умолчанию (:obj:`None`).
uk_ua: Щоб завантажити файл до оперативної пам'яті, ви повинні вказати об’єкт із типом :obj:`typing.BinaryIO` або використати значення за замовчуванням (:obj:`None`).

source: In the first case, the function will return your object:
ru: В первом случае, функция вернёт ваш объект:
uk_ua: У першому випадку функція поверне ваш об’єкт:

source: If you leave the default value, an :obj:`io.BytesIO` object will be created and returned.
ru: Если вы оставите значение по умолчанию, функция создаст и вернёт объект :obj:`io.BytesIO`.
uk_ua: Якщо залишити значення за замовчуванням, буде створено та повернено об’єкт :obj:`io.BytesIO`.

source: Download file in short way
ru: Загрузка файла простым способом
uk_ua: Завантаження файла коротким шляхом

source: Getting `file_path` manually every time is boring, so you should use the `download <#download>`__ method.
ru: Получение `file_path` вручную каждый раз надоедает, поэтому вы должны использовать метод `download <#download>`__.
uk_ua: Щоразу добувати `file_path` вручну нудно, тому вам слід використовувати метод `download <#download>`__.

source: Download file by `file_id` or `Downloadable` object to destination.
ru: Загрузить файл по его `file_id` или с помощью объекта `Downloadable` в пункт назначения.
uk_ua: Завантажує файл за `file_id` або `Downloadable` об’єктом у вказане місце.

source: Download file by file_id or Downloadable object to destination.
uk_ua: Завантажує файл за file_id або Downloadable об’єктом у вказане місце.

source: file_id or Downloadable object
uk_ua: file_id або Downloadable об’єкт

source: It differs from `download_file <#download-file>`__ **only** in that it accepts `file_id` or an `Downloadable` object (object that contains the `file_id` attribute) instead of `file_path`.
ru: Этот метод отличается от `download_file <#download-file>`__ **только** тем, что он принимает `file_id` или объект `Downloadable` (содержащий атрибут `file_id`) вместо `file_path`.
uk_ua: Він відрізняється від `download_file <#download-file>`__ **лише** тим, що приймає `file_id` або `Downloadable` об’єкт (об’єкт, який містить атрибут `file_id`) замість `file_path`.

source: You can download a file to `disk <#download-file-to-disk>`__ or to a `binary I/O <#download-file-to-binary-io-object>`__ object in the same way.
ru: Вы можете загрузить файл на `диск <#download-file-to-disk>`__ или в `binary I/O <#download-file-to-binary-io-object>`__ объект тем же способом.
uk_ua: Ви можете завантажити файл на `disk <#download-file-to-disk>`__ або в `binary I/O object <#download-file-to-binary-io-object>`__ так само.

source: Example:
ru: Пример:
uk_ua: Приклад:
