Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/api/upload_file.po
Languages: ru, uk_ua

source: How to upload file?
ru: Как загрузить файл на сервер Telegram?
uk_ua: Як відвантажити файл?

source: As says `official Telegram Bot API documentation <https://core.telegram.org/bots/api#sending-files>`_ there are three ways to send files (photos, stickers, audio, media, etc.):
ru: Как говорится в `официальной документации Telegram Bot API <https://core.telegram.org/bots/api#sending-files>`_ есть три способа отправлять файлы (фото, стикеры, аудио, медиа, и т.п.):
uk_ua: Як стверджує `official Telegram Bot API documentation <https://core.telegram.org/bots/api#sending-files>`_ існує три способа надіслати файл (фото, наклейки, аудіо, медіа тощо):

source: If the file is already stored somewhere on the Telegram servers or file is available by the URL, you don't need to reupload it.
ru: Если файл уже хранится где-нибудь на серверах Telegram или файл доступен по URL, вам не нужно загружать его заново.
uk_ua: Якщо файл уже зберігається десь на серверах Telegram або файл доступний за URL-адресою, вам не потрібно його повторно завантажувати.

source: :class:`aiogram.types.input_file.FSInputFile` - `uploading from file system <#upload-from-file-system>`__
ru: :class:`aiogram.types.input_file.FSInputFile` - `загрузка из файловой системы <#upload-from-file-system>`__
uk_ua: :class:`aiogram.types.input_file.FSInputFile` - `відвантажений з файлової системи <#upload-from-file-system>`__

source: :class:`aiogram.types.input_file.BufferedInputFile` - `uploading from buffer <#upload-from-buffer>`__
ru: :class:`aiogram.types.input_file.BufferedInputFile` - `загрузка из буфера <#upload-from-buffer>`__
uk_ua: :class:`aiogram.types.input_file.BufferedInputFile` - `відвантажений з буферу <#upload-from-buffer>`__

source: :class:`aiogram.types.input_file.URLInputFile` - `uploading from URL <#upload-from-url>`__
ru: :class:`aiogram.types.input_file.URLInputFile` - `загрузка с URL-адреса <#upload-from-url>`__
uk_ua: :class:`aiogram.types.input_file.URLInputFile` - `відвантажений з URL <#upload-from-url>`__

source: **Be respectful with Telegram**
ru: **Проявите уважение к Telegram**
uk_ua: **Поважайте Telegram**

source: Upload from file system
ru: Загрузка из файловой системы
uk_ua: Відвантаження з файлової системи

source: By first step you will need to import InputFile wrapper:
ru: Сначала вы должны импортировать обёртку InputFile:
uk_ua: Перш за все, вам потрібно буде імпортувати обгортку InputFile:

source: Then you can use it:
ru: Затем вы можете её использовать:
uk_ua: Тепер ви можете використовувати її:

source: Represents object for uploading files from filesystem
uk_ua: Об’єкт для відвантаження файлів із файлової системи

source: Parameters
uk_ua: Параметри

source: Path to file
uk_ua: Шлях до файлу

source: Filename to be propagated to telegram. By default, will be parsed from path
uk_ua: Ім'я файлу, яке буде передано в telegram. За замовчуванням, буде взято зі шляху

source: Uploading chunk size
uk_ua: Розмір фрагмента відвантаження

source: Upload from buffer
ru: Загрузка из буфера
uk_ua: Відвантаження з буферу

source: Import wrapper:
ru: Импортируйте обёртку:
uk_ua: Імпорт обгортки:

source: And then you can use it:
ru: И затем вы можете использовать её:
uk_ua: Тепер ви можете використовувати її:

source: Bytes
uk_ua: Байти

source: Filename to be propagated to telegram.
uk_ua: Ім'я файлу, яке буде передано в telegram.

source: Upload from url
ru: Загрузка с URL-адреса
uk_ua: Відвантаження з URL

source: If you need to upload a file from another server, but the direct link is bound to your server's IP, or you want to bypass native `upload limits <https://core.telegram.org/bots/api#sending-files>`_ by URL, you can use :obj:`aiogram.types.input_file.URLInputFile`.
ru: Если вам нужно загрузить файл с другого сервера, но прямая ссылка привязана к IP-адресу вашего сервера, или вы хотите обойти нативные `ограничения на загрузку <https://core.telegram.org/bots/api#sending-files>`_ с помощью URL, вы можете использовать :obj:`aiogram.types.input_file.URLInputFile`.
uk_ua: Якщо вам потрібно відвантажити файл з іншого сервера, але пряме посилання прив’язано до IP-адреси вашого сервера, або ви хочете обійти власні `обмеження на завантаження <https://core.telegram.org/bots/api#sending-files> `_ за URL-адресою, ви можете використовувати :obj:`aiogram.types.input_file.URLInputFile`.

source: But if you need to upload a new file just use subclasses of `InputFile <types/input_file.md>`__.
ru: Но если вам нужно отправить новый файл, просто используйте подклассы класса `InputFile <types/input_file.md>`__.

source: Here are the three different available builtin types of input file:
ru: Вот все три доступных встроенных типа загрузки файла:

source: Instances of `InputFile` are reusable. That's mean you can create instance of InputFile and sent this file multiple times but Telegram does not recommend to do that and when you upload file once just save their `file_id` and use it in next times.
ru: Экземпляры класса `InputFile` многоразовые. Это значит что вы можете создать экземпляр класса InputFile и отправить этот файл несколько раз, но Telegram не рекомендует так делать, и когда вы загрузите файл в первый раз, просто сохраните его `file_id` и используйте его в следующий раз.

source: Files can be also passed from buffer (For example you generate image using `Pillow <https://pillow.readthedocs.io/en/stable/>`_ and you want to send it to Telegram):
ru: Файлы так же могут быть переданы из буфера (например вы сгенерировали картинку с помощью `Pillow <https://pillow.readthedocs.io/en/stable/>`_ и хотите отправить её в Telegram):
