Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/api/session/aiohttp.po
Languages: ru

source: AiohttpSession represents a wrapper-class around `ClientSession` from `aiohttp <https://pypi.org/project/aiohttp/>`_
ru: AiohttpSession представляет собой класс-оболочку вокруг `ClientSession` из `aiohttp <https://pypi.org/project/aiohttp/>`_

source: Currently `AiohttpSession` is a default session used in `aiogram.Bot`
ru: В настоящее время `AiohttpSession` это сессия, по умолчанию используемая в `aiogram.Bot`

source: Usage example
ru: Пример использования

source: Proxy requests in AiohttpSession
ru: Прокси запросы в AiohttpSession

source: In order to use AiohttpSession with proxy connector you have to install `aiohttp-socks <https://pypi.org/project/aiohttp-socks>`_
ru: Чтобы использовать AiohttpSession с прокси-соединением, вы должны установить `aiohttp-socks <https://pypi.org/project/aiohttp-socks>`_

source: Binding session to bot:
ru: Прикрепление сессии к боту:

source: Only following protocols are supported: http(tunneling), socks4(a), socks5 as aiohttp_socks `documentation <https://github.com/romis2012/aiohttp-socks/blob/master/README.md>`_ claims.
ru: Как утверждается в `документации <https://github.com/romis2012/aiohttp-socks/blob/master/README.md>`_ aiohttp_socks, поддерживаются только следующие протоколы: http(tunneling), socks4(a), socks5.

source: Authorization
ru: Авторизация

source: Proxy authorization credentials can be specified in proxy URL or come as an instance of :obj:`aiohttp.BasicAuth` containing login and password.
ru: Данные для авторизации через прокси-сервер могут быть указаны в URL-адресе прокси-сервера или предоставлены в виде экземпляра :obj:`aiohttp.BasicAuth`, содержащего логин и пароль.

source: Consider examples:
ru: Рассмотрим примеры:

source: or simply include your basic auth credential in URL
ru: или просто включите ваши базовые данные для авторизации в URL

source: Aiogram prefers `BasicAuth` over username and password in URL, so if proxy URL contains login and password and `BasicAuth` object is passed at the same time aiogram will use login and password from `BasicAuth` instance.
ru: Aiogram больше предпочитает `BasicAuth`, чем имя пользователя и пароль в URL, так что если прокси-URL содержит логин и пароль, и в то же время имеется объект `BasicAuth`, aiogram будет использовать логин и пароль из `BasicAuth`.

source: Proxy chains
ru: Цепочки прокси

source: Since `aiohttp-socks <https://pypi.org/project/aiohttp-socks/>`_ supports proxy chains, you're able to use them in aiogram
ru: Так как `aiohttp-socks <https://pypi.org/project/aiohttp-socks/>`_ поддерживает цепочки прокси, вы можете использовать их в aiogram

source: Example of chain proxies:
ru: Пример цепочки прокси:
