Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/dependency_injection.po
Languages: uk_ua

source: Dependency injection
uk_ua: Ін'єкція залежностей

source: Dependency injection is a programming technique that makes a class independent of its dependencies. It achieves that by decoupling the usage of an object from its creation. This helps you to follow `SOLID's <https://en.wikipedia.org/wiki/SOLID>`_ dependency inversion and single responsibility principles.
uk_ua: Ін'єкція залежностей — це техніка програмування, яка робить класи незалежними від їхніх залежностей. Вона досягається шляхом відділення використання об'єкта від його створення. Це допомагає дотримуватися принципів інверсії залежностей та єдиної відповідальності за SOLID.

source: How it works in aiogram
uk_ua: Як це працює в aiogram

source: For each update :class:`aiogram.dispatcher.dispatcher.Dispatcher` passes handling context data. Filters and middleware can also make changes to the context.
uk_ua: Для кожного оновлення :class:`aiogram.dispatcher.dispatcher.Dispatcher` передає дані контексту обробки. Фільтри та проміжне програмне забезпечення також можуть вносити зміни до контексту.

source: To access contextual data you should specify corresponding keyword parameter in handler or filter. For example, to get :class:`aiogram.fsm.context.FSMContext` we do it like that:
uk_ua: Щоб отримати доступ до контекстних даних, ви повинні вказати відповідний параметр ключового слова в обробнику або фільтрі. Наприклад, щоб отримати :class:`aiogram.fsm.context.FSMContext`, ми робимо це так:

source: Injecting own dependencies
uk_ua: Ін'єкція власних залежностей

source: Aiogram provides several ways to complement / modify contextual data.
uk_ua: Aiogram надає кілька способів для доповнення/модифікації контекстних даних.

source: The first and easiest way is to simply specify the named arguments in :class:`aiogram.dispatcher.dispatcher.Dispatcher` initialization, polling start methods or :class:`aiogram.webhook.aiohttp_server.SimpleRequestHandler` initialization if you use webhooks.
uk_ua: Перший і найпростіший спосіб — це просто вказати іменовані аргументи під час ініціалізації :class:`aiogram.dispatcher.dispatcher.Dispatcher`, запуску методів опитування або ініціалізації :class:`aiogram.webhook.aiohttp_server.SimpleRequestHandler`, якщо ви використовуєте вебхуки.

source: Analogy for webhook:
uk_ua: Аналогія для вебхука:

source: :class:`aiogram.dispatcher.dispatcher.Dispatcher`'s workflow data also can be supplemented by setting values as in a dictionary:
uk_ua: Дані робочого процесу :class:`aiogram.dispatcher.dispatcher.Dispatcher` також можуть доповнюватися шляхом встановлення значень, як у словнику:

source: The middlewares updates the context quite often. You can read more about them on this page:
uk_ua: Проміжне програмне забезпечення досить часто оновлює контекст. Ви можете прочитати про це більше на цій сторінці:

source: :ref:`Middlewares <middlewares>`
uk_ua: :ref:`Проміжне програмне забезпечення <middlewares>`

source: The last way is to return a dictionary from the filter:
uk_ua: Останній спосіб — повернути словник із фільтра:

source: ...or using :ref:`MagicFilter <magic-filters>` with :code:`.as_(...)` method.
uk_ua: ...або використовуючи :ref:`MagicFilter <magic-filters>` з методом :code:`.as_(...)`.

source: Using type hints
uk_ua: Використання підказок типів

source: Type-hinting middleware data is optional and is not required for the correct operation of the dispatcher. However, it is recommended to use it to improve the readability of the code.
uk_ua: Використання підказок типів для даних проміжного програмного забезпечення необов'язкове й не потрібне для правильної роботи диспетчера. Проте рекомендується використовувати їх для покращення читабельності коду.

source: You can use type hints to specify the type of the context data in the middlewares, filters and handlers.
uk_ua: Ви можете використовувати підказки типів для визначення типу контекстних даних у проміжному ПЗ, фільтрах та обробниках.

source: The default middleware data typed dict can be found in :class:`aiogram.dispatcher.middlewares.data.MiddlewareData`.
uk_ua: Словник типів даних за замовчуванням для проміжного ПЗ можна знайти в :class:`aiogram.dispatcher.middlewares.data.MiddlewareData`.

source: In case when you have extended the context data, you can use the :class:`aiogram.dispatcher.middlewares.data.MiddlewareData` as a base class and specify the type hints for the new fields.
uk_ua: Якщо ви розширили контекстні дані, ви можете використовувати :class:`aiogram.dispatcher.middlewares.data.MiddlewareData` як базовий клас та вказати підказки типів для нових полів.

source: If you using type checking tools like mypy, you can experience warnings about that this type hint against Liskov substitution principle in due stricter type is not a subclass of :code:`dict[str, Any]`. This is a known issue and it is not a bug. You can ignore this warning or use :code:`# type: ignore` comment.
uk_ua: Якщо ви використовуєте інструменти перевірки типів, такі як mypy, ви можете отримати попередження про те, що ці підказки типів порушують принцип підстановки Лісков через те, що суворіший тип не є підкласом :code:`dict[str, Any]`. Це відома проблема, і це не є помилкою. Ви можете проігнорувати це попередження або використати коментар :code:`# type: ignore`.

source: Example of using type hints:
uk_ua: Приклад використання підказок типів:

source: Available context data type helpers
uk_ua: Доступні помічники для типів контекстних даних

source: Data passed to the handler by the middlewares.
uk_ua: Дані, передані обробнику проміжним ПЗ.

source: You can add your own data by extending this class.
uk_ua: Ви можете додати власні дані, розширивши цей клас.

source: I18n related data.
uk_ua: Дані, пов'язані з I18n.

source: Is not included by default, you need to add it to your own Data class if you need it.
uk_ua: За замовчуванням не включено, вам потрібно додати це до власного класу Даних, якщо це необхідно.

source: I18n object.
uk_ua: Об'єкт I18n.

source: I18n middleware.
uk_ua: Проміжне ПЗ для I18n.
