Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/dispatcher.po
Languages: uk_ua

source: Dispatcher
uk_ua: Диспетчер

source: :ref:`Filtering events`
uk_ua: :ref:`Фільтрація подій`

source: Root router
uk_ua: Кореневий маршрутизатор

source: Parameters
uk_ua: Параметри

source: Storage for FSM
uk_ua: Сховище для кінцевого автомату (FSM)

source: FSM strategy
uk_ua: Стратегія кінцевого автомату

source: Events isolation
uk_ua: Ізоляція подій

source: Disable FSM, note that if you disable FSM then you should not use storage and events isolation
uk_ua: Відключення кінцевого автомату, зауважте, що при вимкненому кінцевому автоматі вам не слід використовувати сховище та ізоляцію подій

source: Other arguments, will be passed as keyword arguments to handlers
uk_ua: Інші аргументи будуть передані обробникам як іменовані аргументи

source: Main entry point for incoming updates with automatic Dict->Update serializer
uk_ua: Основна точка входу для подій з автоматичною серіалізацією Dict->Update

source: Main entry point for incoming updates Response of this method can be used as Webhook response
uk_ua: Основна точка входу для подій. Відповідь цього методу може бути використана для відповіді у Webhook

source: Run many bots with polling
uk_ua: Запуск кількох ботів із використанням опитування

source: Long-polling wait time
uk_ua: Час очікування під час тривалого опитування

source: Run task for each event and no wait result
uk_ua: Запуск завдання для кожної події без очікування результату

source: backoff-retry config
uk_ua: конфігурація повторів із затримкою

source: List of the update types you want your bot to receive
uk_ua: Список типів оновлень, які має отримувати ваш бот

source: handle signals (SIGINT/SIGTERM)
uk_ua: обробка сигналів (SIGINT/SIGTERM)

source: close bot sessions on shutdown
uk_ua: закривати сесії бота під час завершення роботи

source: contextual data
uk_ua: контекстні дані

source: Returns
uk_ua: Повертає

source: Polling runner
uk_ua: Запуск виконавця опитування

source: List of the update types you want your bot to receive By default, all used update types are enabled (resolved from handlers)
uk_ua: Список типів оновлень, які має отримувати ваш бот. За замовчуванням увімкнені всі використовувані типи оновлень (визначено з обробників)

source: Execute this method if you want to stop polling programmatically
uk_ua: Використовуйте цей метод, якщо хочете зупинити опитування програмно

source: Simple usage
uk_ua: Просте використання

source: Example:
uk_ua: Приклад:

source: Including routers
uk_ua: Додавання маршрутизаторів

source: Handling updates
uk_ua: Обробка оновлень

source: All updates can be propagated to the dispatcher by :meth:`~aiogram.dispatcher.dispatcher.Dispatcher.feed_update` method:
uk_ua: Усі оновлення можна передати диспетчеру через метод :meth:`~aiogram.dispatcher.dispatcher.Dispatcher.feed_update`:

source: Also you can feed raw update (dictionary) object to the dispatcher by :meth:`~aiogram.dispatcher.dispatcher.Dispatcher.feed_raw_update` method:
uk_ua: Також ви можете передати сирий об'єкт оновлення (словник) до диспетчера через метод :meth:`~aiogram.dispatcher.dispatcher.Dispatcher.feed_raw_update`:
