Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/flags.po
Languages: uk_ua

source: Flags
uk_ua: Маркери

source: Flags is a markers for handlers that can be used in `middlewares <#use-in-middlewares>`_ or special `utilities <#use-in-utilities>`_ to make classification of the handlers.
uk_ua: Маркери це, так звані мітки для обробників, які можна використовувати `міддлварах <#use-in-middlewares>`_ або в спеціальних `утилітах <#use-in-utilities>`_ щоб провести класифікацію обробників.

source: Flags can be added to the handler via `decorators <#via-decorators>`_, `handlers registration <#via-handler-registration-method>`_ or `filters <via-filters>`_.
uk_ua: Маркери можна додати до обробника через `декоратори <#via-decorators>`_, `реєстрацію обробників <#via-handler-registration-method>`_ або `фільтри <via-filters>`_.

source: Via decorators
uk_ua: Через декоратори

source: For example mark handler with `chat_action` flag
uk_ua: Наприклад, відмітимо обробник маркером `chat_action`

source: Or just for rate-limit or something else
uk_ua: Або просто для рейт-ліміту чи чогось іншого

source: Via handler registration method
uk_ua: Через метод реєстрації обробника

source: Via filters
uk_ua: Через фільтри

source: Use in middlewares
uk_ua: Використовувати в міддлварах

source: Check flags via magic filter
uk_ua: Перевірка прапора за допомогою магічного фільтра

source: Parameters
uk_ua: Параметри

source: handler object or data
uk_ua: об'єкт обробника або дані

source: instance of the magic
uk_ua: приклад магії

source: Returns
uk_ua: Повертає

source: the result of magic filter check
uk_ua: результат перевірки магічного фільтра

source: Extract flags from handler or middleware context data
uk_ua: Витягніть прапор з контекстних даних обробника або проміжного програмного забезпечення

source: dictionary with all handler flags
uk_ua: словник з усіма прапорами обробника

source: Get flag by name
uk_ua: Отримати прапор за назвою

source: name of the flag
uk_ua: назва прапора

source: value of the flag or default
uk_ua: значення прапора або типове значення

source: Example in middlewares
uk_ua: Приклад в міддлварах

source: Use in utilities
uk_ua: Використання в утилітах

source: For example you can collect all registered commands with handler description and then it can be used for generating commands help
uk_ua: Наприклад, ви можете зібрати всі зареєстровані команди з описом обробника, а потім його можна використовувати для створення довідки щодо команд
