Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/middlewares.po
Languages: uk_ua

source: Middlewares
uk_ua: Проміжні програми

source: **aiogram** provides powerful mechanism for customizing event handlers via middlewares.
uk_ua: **aiogram** надає потужний механізм для налаштування обробників(handler) подій через проміжні програми.

source: Middlewares in bot framework seems like Middlewares mechanism in web-frameworks like `aiohttp <https://docs.aiohttp.org/en/stable/web_advanced.html#aiohttp-web-middlewares>`_, `fastapi <https://fastapi.tiangolo.com/tutorial/middleware/>`_, `Django <https://docs.djangoproject.com/en/3.0/topics/http/middleware/>`_ or etc.) with small difference - here is implemented two layers of middlewares (before and after filters).
uk_ua: Проміжні програми у фреймворку для ботів виглядають як механізм проміжних програм у веб-фреймворках, таких як `aiohttp <https://docs.aiohttp.org/en/stable/web_advanced.html#aiohttp-web-middlewares>`_, `fastapi <https://fastapi.tiangolo.com/tutorial/middleware/>`_, `Django <https://docs.djangoproject.com/en/3.0/topics/http/middleware/>`_ тощо) з невеликою різницею – тут реалізовано два рівні проміжного програмних програм (до та після фільтрів).

source: Middleware is function that triggered on every event received from Telegram Bot API in many points on processing pipeline.
uk_ua: Проміжна програма — це функція, яка запускається під час кожної події, отриманої від Telegram Bot API у багатьох точках процесу обробки.

source: Base theory
uk_ua: Основні поняття

source: As many books and other literature in internet says:
uk_ua: Більшість книг та Інтернет-джерел стверджують:

source: Middleware is reusable software that leverages patterns and frameworks to bridge the gap between the functional requirements of applications and the underlying operating systems, network protocol stacks, and databases.
uk_ua: Проміжна програма — це програма, багаторазового використання, що використовує шаблони та фреймворки для ліквідування розриву між функціональними вимогами додатків і основними операційними системами, стеками мережевих протоколів і базами даних.

source: Middleware can modify, extend or reject processing event in many places of pipeline.
uk_ua: Проміжна програма може змінювати, розширювати або відхиляти подію обробки у багатьох точках процесу обробки.

source: Basics
uk_ua: Основи

source: Middleware instance can be applied for every type of Telegram Event (Update, Message, etc.) in two places
uk_ua: Екземпляр проміжної програми можна застосувати для кожного типу події Telegram (оновлення, повідомлення тощо) у двох місцях

source: Outer scope - before processing filters (:code:`<router>.<event>.outer_middleware(...)`)
uk_ua: Зовнішня область - перед обробкою фільтрами (:code:`<router>.<event>.outer_middleware(...)`)

source: Inner scope - after processing filters but before handler (:code:`<router>.<event>.middleware(...)`)
uk_ua: Внутрішня область – після обробки фільтрами, але перед обробником (handler) (:code:`<router>.<event>.middleware(...)`)

source: Middleware basics
uk_ua: Основи проміжних програм

source: Middleware should be subclass of :code:`BaseMiddleware` (:code:`from aiogram import BaseMiddleware`) or any async callable
uk_ua: Проміжна програма має бути підкласом :code:`BaseMiddleware` (:code:`from aiogram import BaseMiddleware`) або будь-якою асинхронною функцією

source: Arguments specification
uk_ua: Специфікація аргументів

source: Bases: :py:class:`~abc.ABC`
uk_ua: Основа: :py:class:`~abc.ABC`

source: Generic middleware class
uk_ua: Узагальнений клас проміжних програм

source: Execute middleware
uk_ua: Виконання проміжної програми

source: Parameters
uk_ua: Параметри

source: Wrapped handler in middlewares chain
uk_ua: Обробник (handler), обгорнутий у ланцюжок проміжних програм

source: Incoming event (Subclass of :class:`aiogram.types.base.TelegramObject`)
uk_ua: Вхідна подія (підклас :class:`aiogram.types.base.TelegramObject`)

source: Contextual data. Will be mapped to handler arguments
uk_ua: Контекстні дані. Будуть зіставлені з аргументами обробника

source: Returns
uk_ua: Повертає

source: Examples
uk_ua: Приклади

source: Class-based
uk_ua: Класово орієнтований

source: and then
uk_ua: і тоді

source: Function-based
uk_ua: Функціонально-орієнтований

source: Facts
uk_ua: Факти

source: Middlewares from outer scope will be called on every incoming event
uk_ua: Проміжні програми із зовнішньої області викликатимуться під час кожної вхідної події

source: Middlewares from inner scope will be called only when filters pass
uk_ua: Проміжні програми із внутрішньої області викликатимуться лише після проходження фільтрів

source: Inner middlewares is always calls for :class:`aiogram.types.update.Update` event type in due to all incoming updates going to specific event type handler through built in update handler
uk_ua: Внутрішні проміжні програми викликають тип події :class:`aiogram.types.update.Update` , через те, що всі вхідні оновлення надходять до обробника (handler) певного типу подій через вбудований обробник (handler) оновлень
