Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/observer.po
Languages: uk_ua

source: Observer
uk_ua: Обсервер

source: Observer is used for filtering and handling different events. That is part of internal API with some public methods and is recommended to don't use methods is not listed here.
uk_ua: Обсервер використовується для фільтрації та обробки різних подій. Це частина внутрішнього API з деякими публічними методами, тому рекомендується не використовувати методи, яких тут немає.

source: In `aiogram` framework is available two variants of observer:
uk_ua: У фреймвоку `aiogram` доступні два варіанти обсервера:

source: Simple events observer
uk_ua: Простий обсервер(спостерігач) подій

source: Is used for managing events is not related with Telegram (For example startup/shutdown processes)
uk_ua: Використовується для керування подіями, не пов’язаними з Telegram (наприклад, запуску/вимкнення процесів)

source: Handlers can be registered via decorator or method
uk_ua: Обробники(Handler) можна зареєструвати за допомогою декоратора або методу

source: Register callback with filters
uk_ua: Реєстрація обробника(callback) з фільтрами

source: Propagate event to handlers. Handler will be called when all its filters is pass.
uk_ua: Передача події обробникам подій(handler). Обробник буде викликано, коли всі його фільтри пройдено.

source: Decorator for registering event handlers
uk_ua: Декоратор для реєстрації обробника подій(handler)

source: Event observer for Telegram events
uk_ua: Обсервер подій для подій Telegram

source: Here you can register handler with filter. This observer will stop event propagation when first handler is pass.
uk_ua: Тут Ви можете зареєструвати обробник(handler) із фільтрами. Цей обсервер зупинить розповсюдження події, коли справцює перший обробник(handler).

source: Register event handler
uk_ua: Реєстрація обробника подій(handler)

source: Propagate event to handlers and stops propagation on first match. Handler will be called when all its filters is pass.
uk_ua: Передача події обробнику подій(handler) та зупинка при першому ж збігу. Обробник(handler) буде викликало, коли всі його фільтри пройдено.
