Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/dispatcher/router.po
Languages: uk_ua

source: Router
uk_ua: Маршрутизатор

source: Bases: :py:class:`object`
uk_ua: Базується на :py:class:`object`

source: Router can route update, and it nested update types like messages, callback query, polls and all other event types.
uk_ua: Маршрутизатор може маршрутизувати події, а також вкладені типи оновлень, такі як повідомлення, запит зворотного виклику, опитування та всі інші типи подій.

source: Event handlers can be registered in observer by two ways:
uk_ua: Обробники подій можуть бути зареєстровані в обсервері двома шляхами:

source: By observer method - :obj:`router.<event_type>.register(handler, <filters, ...>)`
uk_ua: За допомогою методу обсервера - :obj:`router.<event_type>.register(handler, <filters, ...>)`

source: By decorator - :obj:`@router.<event_type>(<filters, ...>)`
uk_ua: За допомогою декоратора - :obj:`@router.<event_type>(<filters, ...>)`

source: Parameters
uk_ua: Параметри

source: Optional router name, can be useful for debugging
uk_ua: Додаткова назва маршрутизатора, може бути корисною для відлагодження

source: Attach another router.
uk_ua: Підключення маршрутизатора.

source: Returns
uk_ua: Повертає

source: Event observers
uk_ua: Обсервери подій

source: All handlers always should be asynchronous. The name of the handler function is not important. The event argument name is also not important but it is recommended to not overlap the name with contextual data in due to function can not accept two arguments with the same name.
uk_ua: Усі обробники завжди мають бути асинхронними. Ім'я функції обробки не має значення. Назва аргументу події також не важлива, але рекомендується не накладати назву на контекстні дані, оскільки функція не може прийняти два аргументи з однаковою назвою.

source: Here is the list of available observers and examples of how to register handlers
uk_ua: Ось список доступних обсерверів і приклади того, як зареєструвати обробники

source: In these examples only decorator-style registering handlers are used, but if you don't like @decorators just use :obj:`<event type>.register(...)` method instead.
uk_ua: У цих прикладах використовуються лише обробники реєстрації у стилі декоратора, але якщо вам не подобаються @decorators, просто використовуйте :obj:`<event type>.register(...)` method instead.

source: Message
uk_ua: Повідомлення

source: Be attentive with filtering this event
uk_ua: Будьте уважні при фільтруванні цієї події

source: You should expect that this event can be with different sets of attributes in different cases
uk_ua: Вам слід очікувати, що ця подія може мати різні набори атрибутів у різних випадках

source: (For example text, sticker and document are always of different content types of message)
uk_ua: (Наприклад, текст, стікер та документ завжди мають різні типи вмісту)

source: Recommended way to check field availability before usage, for example via :ref:`magic filter <magic-filters>`: :code:`F.text` to handle text, :code:`F.sticker` to handle stickers only and etc.
uk_ua: Рекомендований спосіб перевірити наявність полів перед використанням, наприклад за допомогою :ref:`magic filter <magic-filters>`: :code:`F.text` для обробки тексту, :code:`F.sticker` для обробки лише стікерів і тощо.

source: Edited message
uk_ua: Відредаговане повідомлення

source: Channel post
uk_ua: Пост на каналі

source: Edited channel post
uk_ua: Відредагований пост на каналі

source: Inline query
uk_ua: Inline запит

source: Chosen inline query
uk_ua: Вибраний результат inline запиту

source: Callback query
uk_ua: Запит зворотної відповіді

source: Shipping query
uk_ua: Запит підтвердження доставки

source: Pre checkout query
uk_ua: Запит перед оформленням замовлення

source: Poll
uk_ua: Опитування

source: Poll answer
uk_ua: Відповідь на опитування

source: Errors
uk_ua: Помилки

source: Nested routers
uk_ua: Вкладені маршрутизатори

source: Routers by the way can be nested to an another routers with some limitations:
uk_ua: До речі, маршрутизатори можуть бути вкладеними в інші маршрутизатори з деякими обмеженнями:

source: 1. Router **CAN NOT** include itself 1. Routers **CAN NOT** be used for circular including (router 1 include router 2, router 2 include router 3, router 3 include router 1)
uk_ua: 1. Маршрутизатор **НЕ МОЖЕ** включити себе 2. Маршрутизатори **НЕ МОЖНА** використовувати для циклічного включення (маршрутизатор 1 включає маршрутизатор 2, маршрутизатор 2 включає маршрутизатор 3, маршрутизатор 3 включає маршрутизатор 1)

source: Example:
uk_ua: Приклад:

source: Update
uk_ua: Оновлення

source: How it works?
uk_ua: Як це працює?

source: For example, dispatcher has 2 routers, the last router also has one nested router:
uk_ua: Наприклад, диспетчер має 2 маршрутизатори, останній маршрутизатор також має один вкладений маршрутизатор:

source: Nested routers example
uk_ua: Приклад вкладених маршрутизаторів

source: In this case update propagation flow will have form:
uk_ua: У цьому випадку потік розповсюдження оновлення матиме вигляд:
