Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/api/methods/add_sticker_to_set.po
Languages: uk_ua

source: Returns: :obj:`bool`
uk_ua: Повертає: :obj:`bool`

source: Use this method to add a new sticker to a set created by the bot. You **must** use exactly one of the fields *png_sticker*, *tgs_sticker*, or *webm_sticker*. Animated stickers can be added to animated sticker sets and only to them. Animated sticker sets can have up to 50 stickers. Static sticker sets can have up to 120 stickers. Returns :code:`True` on success.
uk_ua: Використовуйте цей метод, щоб додати нову наклейку до набору, створеного ботом. Ви **повинні** використовувати саме одне з полів *png_sticker*, *tgs_sticker* або *webm_sticker*. Анімовані стікери можна додавати до наборів анімованих стікерів і тільки до них. Набори анімованих наклейок можуть містити до 50 наклейок. Набори статичних наклейок можуть містити до 120 наклейок. Повертає :code:`True` у разі успіху.

source: Source: https://core.telegram.org/bots/api#addstickertoset
uk_ua: Джерело: https://core.telegram.org/bots/api#addstickertoset

source: User identifier of sticker set owner
uk_ua: Ідентифікатор користувача власника набору наклейок

source: Sticker set name
uk_ua: Назва набору наклейок

source: One or more emoji corresponding to the sticker
uk_ua: Один або кілька емодзі, що відповідають наклейці

source: **PNG** image with the sticker, must be up to 512 kilobytes in size, dimensions must not exceed 512px, and either width or height must be exactly 512px. Pass a *file_id* as a String to send a file that already exists on the Telegram servers, pass an HTTP URL as a String for Telegram to get a file from the Internet, or upload a new one using multipart/form-data. :ref:`More information on Sending Files » <sending-files>`
uk_ua: **PNG** зображення з наклейкою має бути розміром до 512 кілобайт, розміри не повинні перевищувати 512 пікселів, а ширина або висота мають бути точно 512 пікселів. Передайте *file_id* як рядок, щоб надіслати файл, який уже існує на серверах Telegram, передайте URL-адресу HTTP як рядок для Telegram, щоб отримати файл з Інтернету, або завантажте новий за допомогою multipart/form-data. :ref:`Докладніше про надсилання файлів <sending-files>`

source: **TGS** animation with the sticker, uploaded using multipart/form-data. See `https://core.telegram.org/stickers#animated-sticker-requirements <https://core.telegram.org/stickers#animated-sticker-requirements>`_`https://core.telegram.org/stickers#animated-sticker-requirements <https://core.telegram.org/stickers#animated-sticker-requirements>`_ for technical requirements
uk_ua: **TGS** анімація зі стікером, завантажена за допомогою multipart/form-data. Див `https://core.telegram.org/stickers#animated-sticker-requirements <https://core.telegram.org/stickers#animated-sticker-requirements>`_`https://core.telegram.org/stickers#animated-sticker-requirements <https://core.telegram.org/stickers#animated-sticker-requirements>`_ щодо технічних вимог

source: **WEBM** video with the sticker, uploaded using multipart/form-data. See `https://core.telegram.org/stickers#video-sticker-requirements <https://core.telegram.org/stickers#video-sticker-requirements>`_`https://core.telegram.org/stickers#video-sticker-requirements <https://core.telegram.org/stickers#video-sticker-requirements>`_ for technical requirements
uk_ua: Відео **WEBM** із наклейкою, завантажене за допомогою multipart/form-data. Див `https://core.telegram.org/stickers#video-sticker-requirements <https://core.telegram.org/stickers#video-sticker-requirements>`_`https://core.telegram.org/stickers#video-sticker-requirements <https://core.telegram.org/stickers#video-sticker-requirements>`_ для технічних вимог

source: A JSON-serialized object for position where the mask should be placed on faces
uk_ua: Серіалізований за допомогою JSON об’єкт для позиції маски на обличчях

source: Usage
uk_ua: Використання

source: As bot method
uk_ua: Як метод юота

source: Method as object
uk_ua: Метод як об'єкт

source: Imports:
uk_ua: Імпорти:

source: alias: :code:`from aiogram.methods import AddStickerToSet`
uk_ua: псевдонім: :code:`from aiogram.methods import AddStickerToSet`

source: With specific bot
uk_ua: З конкретним ботом

source: As reply into Webhook in handler
uk_ua: Як відповідь на Webhook в обробнику
