Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/api/methods/answer_callback_query.po
Languages: uk_ua

source: Returns: :obj:`bool`
uk_ua: Повертає: :obj:`bool`

source: Use this method to send answers to callback queries sent from `inline keyboards <https://core.telegram.org/bots/features#inline-keyboards>`_. The answer will be displayed to the user as a notification at the top of the chat screen or as an alert. On success, :code:`True` is returned.
uk_ua: Використовуйте цей метод, щоб надсилати відповіді на запити зворотного виклику, надіслані з `inline keyboards <https://core.telegram.org/bots/features#inline-keyboards>`_. Відповідь відображатиметься користувачеві як сповіщення у верхній частині екрана чату або як сповіщення. У разі успіху повертається :code:`True`.

source: Alternatively, the user can be redirected to the specified Game URL. For this option to work, you must first create a game for your bot via `@BotFather <https://t.me/botfather>`_ and accept the terms. Otherwise, you may use links like :code:`t.me/your_bot?start=XXXX` that open your bot with a parameter.
uk_ua: Крім того, користувач може бути перенаправлений на вказану URL-адресу гри. Щоб цей варіант працював, ви повинні спочатку створити гру для свого бота через `@BotFather <https://t.me/botfather>`_ і прийняти умови. В іншому випадку ви можете використовувати такі посилання, як :code:`t.me/your_bot?start=XXXX`, які відкривають вашого бота за допомогою параметра.

source: Source: https://core.telegram.org/bots/api#answercallbackquery
uk_ua: Джерело: https://core.telegram.org/bots/api#answercallbackquery

source: Unique identifier for the query to be answered
uk_ua: Унікальний ідентифікатор запиту, на який потрібно відповісти

source: Text of the notification. If not specified, nothing will be shown to the user, 0-200 characters
uk_ua: Текст повідомлення. Якщо не вказано, користувачеві нічого не буде показано, 0-200 символів

source: If :code:`True`, an alert will be shown by the client instead of a notification at the top of the chat screen. Defaults to *false*.
uk_ua: Якщо :code:`True`, клієнт відображатиме сповіщення замість сповіщення у верхній частині екрана чату. За замовчуванням *false*.

source: URL that will be opened by the user's client. If you have created a :class:`aiogram.types.game.Game` and accepted the conditions via `@BotFather <https://t.me/botfather>`_, specify the URL that opens your game - note that this will only work if the query comes from a `https://core.telegram.org/bots/api#inlinekeyboardbutton <https://core.telegram.org/bots/api#inlinekeyboardbutton>`_ *callback_game* button.
uk_ua: URL-адреса, яку відкриє клієнт користувача. Якщо ви створили :class:`aiogram.types.game.Game` і прийняли умови через `@BotFather <https://t.me/botfather>`_, укажіть URL-адресу, за якою відкривається ваша гра - зауважте, що це працюватиме, лише якщо запит надходить із кнопки `https://core.telegram.org/bots/api#inlinekeyboardbutton <https://core.telegram.org/bots/api#inlinekeyboardbutton>`_ *callback_game*.

source: The maximum amount of time in seconds that the result of the callback query may be cached client-side. Telegram apps will support caching starting in version 3.14. Defaults to 0.
uk_ua: Максимальний час у секундах, протягом якого результат запиту зворотного виклику може кешуватися на стороні клієнта. Додатки Telegram підтримуватимуть кешування, починаючи з версії 3.14. За замовчуванням 0.

source: Usage
uk_ua: Використання

source: As bot method
uk_ua: Як метод бота

source: Method as object
uk_ua: Метод як об'єкт

source: Imports:
uk_ua: Імпорти:

source: alias: :code:`from aiogram.methods import AnswerCallbackQuery`
uk_ua: псевдонім: :code:`from aiogram.methods import AnswerCallbackQuery`

source: With specific bot
uk_ua: З конкретним ботом

source: As reply into Webhook in handler
uk_ua: Як відповідь на Webhook в обробнику

source: As shortcut from received object
uk_ua: Як ярлик отриманого об'єкта
