Repository: aiogram/aiogram
Catalog: docs/locale/*/LC_MESSAGES/api/methods/answer_inline_query.po
Languages: uk_ua

source: Returns: :obj:`bool`
uk_ua: Повертає: :obj:`bool`

source: Use this method to send answers to an inline query. On success, :code:`True` is returned.
uk_ua: Використовуйте цей метод, щоб надіслати відповіді на inline запит. У разі успіху повертається :code:`True`.

source: No more than **50** results per query are allowed.
uk_ua: На запит допускається не більше **50** результатів.

source: Source: https://core.telegram.org/bots/api#answerinlinequery
uk_ua: Джерело: https://core.telegram.org/bots/api#answerinlinequery

source: Unique identifier for the answered query
uk_ua: Унікальний ідентифікатор для відповідного запиту

source: A JSON-serialized array of results for the inline query
uk_ua: Серіалізований у JSON масив результатів для inline запиту

source: The maximum amount of time in seconds that the result of the inline query may be cached on the server. Defaults to 300.
uk_ua: Максимальний час у секундах, протягом якого результат inline запиту може кешуватися на сервері. За замовчуванням 300.

source: Pass :code:`True` if results may be cached on the server side only for the user that sent the query. By default, results may be returned to any user who sends the same query
uk_ua: Передайте :code:`True`, якщо результати можуть кешуватися на стороні сервера лише для користувача, який надіслав запит. За замовчуванням результати можуть повертатися будь-якому користувачеві, який надсилає той самий запит

source: Pass the offset that a client should send in the next query with the same text to receive more results. Pass an empty string if there are no more results or if you don't support pagination. Offset length can't exceed 64 bytes.
uk_ua: Передайте зсув, який клієнт повинен надіслати в наступному запиті з тим самим текстом, щоб отримати більше результатів. Передайте порожній рядок, якщо більше немає результатів або якщо ви не підтримуєте розбивку на сторінки. Довжина зміщення не може перевищувати 64 байти.

source: If passed, clients will display a button with specified text that switches the user to a private chat with the bot and sends the bot a start message with the parameter *switch_pm_parameter*
uk_ua: Якщо прийнято, клієнти відображатимуть кнопку з указаним текстом, яка перемикає користувача на приватний чат із ботом і надсилає боту початкове повідомлення з параметром *switch_pm_parameter*

source: `Deep-linking <https://core.telegram.org/bots/features#deep-linking>`_ parameter for the /start message sent to the bot when user presses the switch button. 1-64 characters, only :code:`A-Z`, :code:`a-z`, :code:`0-9`, :code:`_` and :code:`-` are allowed.
uk_ua: Параметр `Deep-linking <https://core.telegram.org/bots/features#deep-linking>`_ для повідомлення /start, яке надсилається боту, коли користувач натискає кнопку перемикання. 1–64 символи, дозволені лише :code:`A-Z`, :code:`a-z`, :code:`0-9`, :code:`_` і :code:`-`.

source: Usage
uk_ua: Використання

source: As bot method
uk_ua: Як метод бота

source: Method as object
uk_ua: Метод як об'єкт

source: Imports:
uk_ua: Імпорти:

source: alias: :code:`from aiogram.methods import AnswerInlineQuery`
uk_ua: псевдонім: :code:`from aiogram.methods import AnswerInlineQuery`

source: With specific bot
uk_ua: З конкретним ботом

source: As reply into Webhook in handler
uk_ua: Як відповідь на Webhook в обробнику

source: As shortcut from received object
uk_ua: Як ярлик отриманого об'єкта
